/**
 * 
 */
package com.tainy.common;



/**
 * 
 * API 返回结果码
 * 
 * @author wxtdy
 *
 */

public enum ResultCodeMsgEnum {
	
	/**
	 *  各系统编码范围
	 *  
	 *  Merchant 1000-1999
		Oder 2000-2999
		Waiter 3000-3999
		Vendor 4000-4999
		Account 5000-5999
		Payment 6000-6999
		Mall 7000-7999
		Boss 8000-8999
		Crm 9000-9999
		Reward 10000-10999
		Platform 11000-11999
	 */

	SUCCESS(0, "成功！", "成功！"), 
	FAIL(1, "失败！", "失败！"), 
	
	ERR_CODE_EXCEPTION(2,"未处理异常", "未处理异常"),
	
	ERR_CODE_PARAM_EMPTY(600,"上行参数（对象）为空", "上行参数（对象）为空"),
	ERR_CODE_PARAM_MISSING_OR_PARAM_INVALID(601,"缺少必填参数或参数非法", "缺少必填参数或参数非法"),
	ERR_CODE_PARAM_MISSING(602,"缺少必填参数", "缺少必填参数"),
	ERR_CODE_PARAM_INVALID(603,"非法参数", "非法参数"),
	ERR_CODE_RESOURCE_NOT_FOUND(604,"无法定位请求资源", "无法定位请求资源"),
	ERR_CODE_DUBBO_TIMEOUT(605,"DUBBO连接超时", "DUBBO连接超时"),
	ERR_CODE_ORDER_ISPAYED(606,"订单已经支付，不能再次支付","订单已经支付，不能再次支付"),
	
	/**
	 * 支付系统
	 */
	ERROR_IOEXCEPTION(6000, "系统异常", "系统异常"),
	ERROR_MISSPARAEXCEPTION(6001, "请求参数错误", "请求参数错误"),
	ERROR_WX_TRADE_TYPE(6002, "trade_type错误！", "trade_type错误！"),
	订单支付账单不存在(6003, "订单支付账单不存在", "订单支付账单不存在"),
	订单正在支付中(6004, "订单正在支付中", "订单正在支付中"),
	订单已支付(6005, "订单已支付", "订单已支付"),
	商户收款账号不存在(6006, "商户收款账号不存在", "商户收款账号不存在"),
	
	/**
	 * 订单系统
	 */
	ORDER_PARAMERTER_EMPTY(2000,"参数信息为空", "参数信息为空"),
	ORDER_PARAMETER_NOT_VALID(2001,"必填信息为空", "必填信息为空"),
	ORDER_APP_EXCEPTION(2003,"", ""),
	ORDER_TABLE_STATUS_EMPTY(2004,"桌台状态为空", "桌台状态为空"),
	ORDER_ORDER_CART_EMPTY(2005,"购物车为空", "购物车为空"),
	ORDER_ORDER_EMPTY(2006,"订单信息为空", "订单信息为空"),
	ORDER_CART_ADD_ITEM_ERROR(2007,"购物车添加菜品失败", "购物车添加菜品失败"),
	ORDER_CART_DELETE_ITEM_ERROR(2008,"购物车减菜失败，该菜品已被减掉", "购物车减菜失败，该菜品已被减掉"),
	
	ORDER_CART_UPDATE_ORDER_ERROR(2009,"购物车菜品不存在，修改失败", "购物车菜品不存在，修改失败"),
	订单菜品不存在_修改失败(2009,"订单菜品不存在，修改失败", "订单菜品不存在，修改失败"),
	
	ORDER_NO_AUTHORITY_VIEW_ORDER(2010,"无权查看订单信息", "无权查看订单信息"),
	ORDER_TABLE_STATUS_CHENAGE(2011,"", ""),
	ORDER_ORDER_SUBMIT_DUPLICATED(2012,"", ""),
	
	ORDER_ITEM_ADD_ITEM_ERROR(2013,"订单加菜失败", "订单加菜失败"),
	订单已经支付_不能再加菜(2013,"订单已经支付,不能再加菜", "订单已经支付,不能再加菜"),
	订单菜品审核失败(2013,"订单菜品审核失败", "订单菜品审核失败"),
	订单正在处理(2013,"订单正在处理！", "订订单正在处理！"),
	
	ORDER_ITEM_DELETE_ITEM_ERROR(2014,"", ""),
	ORDER_ORDER_ITEM_EMPTY(2015,"菜品信息为空", "菜品信息为空"),
	
	ORDER_ORDER_NOT_EXIT(2016,"参数传递有误或该订单不存在", "参数传递有误或该订单不存在"),
	订单已经支付_不要重复支付(2016,"订单已经支付，不要重复支付", "订单已经支付，不要重复支付"),
	
	ORDER_ITEM_REFUSE_ITEM_ERROR(2017,"菜品已确认，不可重复操作", "菜品已确认，不可重复操作"),
	转台失败(2017,"转台失败","转台失败"),
	审核菜品失败(2017,"审核菜品失败","审核菜品失败"),
	拒绝菜品失败(2017,"拒绝菜品失败","拒绝菜品失败"),
	订单正在处理_审核菜品(2017,"订单正在处理_审核菜品","订单正在处理_审核菜品"),
	
	ORDER_ITEM_REFUSE_ITEM_SUCCESS(2018,"", ""),
	ORDER_ADD_SUCCESS(2019,"", ""),
	ORDER_MSG_NO_WAITER(2020,"", ""),
	ORDER_SUBMIT_ORDER_ERROR(2021,"购物车提交失败", "购物车提交失败"),
	MSG_WAITER_SERVICE_CALL_ERROR(2022,"发送呼叫消息失败", "发送呼叫消息失败"),
	ORDER_PAY(2023,"", ""),
	ORDER_ITEM_NOT_EXIT(2024,"", ""),
	ORDER_ITEM_DEL_ITEM_ERROR(2025,"", ""),
	ORDER_TABLE_NO_WAITER(2026,"", ""),
	ORDER_ITEM_CHECK_ITEM_ERROR(2027,"划菜失败", "划菜失败"),
	ORDER_ITEM_URGE_ITEM_ERROR(2028,"催菜失败", "催菜失败"),
	ORDER_CHECK_ERROR(2029,"", ""),
	
	ORDER_NOAUTHORITY(2030,"无权操作该商户桌台购物车信息", "无权操作该商户桌台购物车信息"),
	无权操作该商户桌台信息(2030,"无权操作该商户桌台信息", "无权操作该商户桌台信息"),
	无权操作该商户订单信息(2030,"无权操作该商户订单信息", "无权操作该商户订单信息"),
	
	ORDER_ITEM_CANCELLED_ERROR(2031,"退菜失败", "退菜失败"),
	菜品不可退(2031,"菜品不可退", "菜品不可退"),
	菜品已下厨_无法删除(2031,"菜品已下厨，无法删除", "菜品已下厨，无法删除"),
	订单已确认_无法删除(2031,"订单已确认，无法删除", "订单已确认，无法删除"),
	
	MSG_WAITER_RESPOND_YES(2032,"其他服务员已响应", "其他服务员已响应"),
	ORDER_FUNCTION_UPGRADE(2033,"", ""),
	TABLE_STATUS_INVALID(2034,"", ""),
	
	ORDER_REVERSE_PAY_FAIL(2035,"订单尚未完成支付，无需反结账", "订单尚未完成支付，无需反结账"),
	反结账原因不能为空(2035,"反结账原因不能为空", "反结账原因不能为空"),
	//参数传递有误或该订单不存在(2035,"参数传递有误或该订单不存在", "参数传递有误或该订单不存在"),
	反结账的账单不存在(2035,"反结账的账单不存在", "反结账的账单不存在"),
	反结账失败(2035,"反结账失败", "反结账失败"),
	
	TABLE_MERGE_ERROR(2036,"桌子状态为空，无法合并", "桌子状态为空，无法合并"),
	空闲预定脏台锁定的桌台不能合并(2036,"空闲、预定、脏台、锁定的桌台不能合并", "空闲、预定、脏台、锁定的桌台不能合并"),
	存在下单待审或下厨加菜或买单待审桌台_请先审核后再合并(2036,"存在下单待审或下厨加菜或买单待审桌台，请先审核后再合并", "存在下单待审或下厨加菜或买单待审桌台，请先审核后再合并"),
	不符合转台规则(2036,"不符合转台规则", "不符合转台规则"),
	合并桌台失败(2036,"合并桌台失败", "合并桌台失败"),
	一个餐桌无法操作并台(2036,"一个餐桌无法操作并台", "一个餐桌无法操作并台"),
	该渠道无权操作并台(2036,"该渠道无权操作并台", "该渠道无权操作并台"),
	桌台已合并(2036,"桌台已合并", "桌台已合并"),
	桌台合并正在处理(2036,"桌台合并正在处理", "桌台合并正在处理"),
	未查询到任何桌台(2036,"未查询到任何桌台", "未查询到任何桌台"),
	
	TABLE_SPLIT_ERROR(2037,"拆台失败", "拆台失败"),
	该渠道无权操作拆台(2037,"该渠道无权操作拆台", "该渠道无权操作拆台"),
	待拆分的桌台桌态为空(2037,"待拆分的桌台桌态为空", "待拆分的桌台桌态为空"),
	待拆分桌台购物车为空(2037,"待拆分桌台购物车为空", "待拆分桌台购物车为空"),
	桌台拆分正在处理(2037,"桌台拆分正在处理", "桌台拆分正在处理"),
	待拆分的桌台历史合台记录不存在或桌台已拆分(2037,"待拆分的桌台历史合台记录不存在或桌台已拆分", "待拆分的桌台历史合台记录不存在或桌台已拆分"),
	合并后桌态已变更_无法再拆回(2037,"合并后桌态已变更,无法再拆回", "合并后桌态已变更,无法再拆回"),
	原桌台已被占用_无法再拆回(2037,"原桌台已被占用，无法再拆回", "原桌台已被占用，无法再拆回"),
	原桌台已清台_恢复空闲桌态失败_无法再拆回(2037,"原桌台已清台，恢复空闲桌态失败，无法再拆回", "原桌台已清台，恢复空闲桌态失败，无法再拆回"),
	原桌台已清台_购物车恢复失败_无法再拆回(2037,"原桌台已清台，购物车恢复失败，无法再拆回", "原桌台已清台，购物车恢复失败，无法再拆回"),
	原桌台购物车拆分还原更新失败(2037,"原桌台购物车拆分还原更新失败", "原桌台购物车拆分还原更新失败"),
	当前桌台购物车拆分还原更新失败(2037,"当前桌台购物车拆分还原更新失败", "当前桌台购物车拆分还原更新失败"),
	原桌台状态信息还原更新失败(2037,"原桌台状态信息还原更新失败", "原桌台状态信息还原更新失败"),
	当前桌台状态信息还原更新失败(2037,"当前桌台状态信息还原更新失败", "当前桌台状态信息还原更新失败"),
	
	ORDER_MEMBER_INVALID(2038,"会员账号不存在", "会员账号不存在"),
	ORDER_PREPARE_PAY_FAIL(2039,"账单生成失败", "账单生成失败"),
	
	ORDER_PAY_DISCOUNT_FAIL(2040,"订单已存在BOSS折扣，不可再使用会员优惠", "订单已存在BOSS折扣，不可再使用会员优惠"),
	订单已存在BOSS折扣_不可再设置其他折扣方案(2040,"订单已存在BOSS折扣，不可再设置其他折扣方案", "订单已存在BOSS折扣，不可再设置其他折扣方案"),
	订单抹零金额不能超过订单应付总额(2040,"订单抹零金额不能超过订单应付总额", "订单抹零金额不能超过订单应付总额"),
	商户折扣不存在或折扣政策已过期(2040,"商户折扣不存在或折扣政策已过期", "商户折扣不存在或折扣政策已过期"),
	
	ORDER_TABLE_BOOKED(2041,"", ""),
	
	ORDER_BOOK_NOT_EXISTS(2042,"查询预订记录的商户id为空", "查询预订记录的商户id为空"),
	商户餐段不存在(2042,"商户餐段不存在", "查商户餐段不存在"),
	
	ORDER_BOOK_PERORDER_DEAL_FAIL(2043,"", ""),
	
	ORDER_PICKUP_FAIL(2044,"订单不存在或菜单等叫叫起类型为空", "订单不存在或菜单等叫叫起类型为空"),
	菜单等叫叫起类型错误(2044,"菜单等叫叫起类型错误", "菜单等叫叫起类型错误"),
	没有菜品等叫需要叫起(2044,"没有菜品等叫需要叫起", "没有菜品等叫需要叫起"),
	该菜类没有菜品等叫_不可操作叫起(2044,"该菜类没有菜品等叫，不可操作叫起", "该菜类没有菜品等叫，不可操作叫起"),
	所选菜品未曾等叫_不可操作叫起(2044,"所选菜品未曾等叫，不可操作叫起", "所选菜品未曾等叫，不可操作叫起"),
	
	ORDER_BOOK_FAIL(2045,"预订预留电话无效", "预订预留电话无效"),
	商户未设置班次餐段(2045,"商户未设置班次餐段", "商户未设置班次餐段"),
	预订当天时间不在营业时间餐段内_预订失败(2045,"预订当天时间不在营业时间餐段内，预订失败", "预订当天时间不在营业时间餐段内，预订失败"),
	预订日期时间不能小于当前日期时间(2045,"预订日期时间不能小于当前日期时间", "预订日期时间不能小于当前日期时间"),
	没有指定具体的预订时间_预订餐段也不存在(2045,"没有指定具体的预订时间，预订餐段也不存在", "没有指定具体的预订时间，预订餐段也不存在"),
	没有指定具体的预订时间_预定的当前餐段已经结束_预订失败(2045,"没有指定具体的预订时间，预定的当前餐段已经结束，预订失败", "没有指定具体的预订时间，预定的当前餐段已经结束，预订失败"),
	既没有指定预订时间_也没有选择预订餐段_无法进行预订(2045,"既没有指定预订时间，也没有选择预订餐段，无法进行预订", "既没有指定预订时间，也没有选择预订餐段，无法进行预订"),
	该餐桌已在同天同餐段被预定_预订失败(2045,"该餐桌已在同天同餐段被预定，预订失败", "该餐桌已在同天同餐段被预定，预订失败"),
	该餐桌当前餐段已被占用_预订失败(2045,"该餐桌当前餐段已被占用，预订失败", "该餐桌当前餐段已被占用，预订失败"),
	预订失败(2045,"预订失败", "预订失败"),
	
	ORDER_GIVE_DISHES_FAIL(2046,"请确定已经下单了", "请确定已经下单了"),
	订单已经支付成功了_不能修改菜品重量(2046,"订单已经支付成功了，不能修改菜品重量", "订单已经支付成功了，不能修改菜品重量"),
	订单已经支付成功了_不能赠菜(2046,"订单已经支付成功了，不能赠菜", "订单已经支付成功了，不能赠菜"),
	
	待支付的账单重复(2047,"待支付的账单重复", "待支付的账单重复"),
	账单生成失败(2047,"账单生成失败", "账单生成失败"),
	闪付失败(2047,"闪付失败", "闪付失败"),
	生成账单费用明细失败(2047,"生成账单费用明细失败", "生成账单费用明细失败"),
	订单不存在待付款项(2047,"订单不存在待付款项", "订单不存在待付款项"),
	当前桌台进行了转台或并台操作_请到目标台进行支付(2047,"当前桌台进行了转台或并台操作，请到目标台进行支付", "当前桌台进行了转台或并台操作，请到目标台进行支付"),
	没有待支付的订单或订单已支付成功_请勿重复支付(2047,"没有待支付的订单或订单已支付成功，请勿重复支付", "没有待支付的订单或订单已支付成功，请勿重复支付"),
	订单生成账单和明细失败(2047,"订单生成账单和明细失败", "订单生成账单和明细失败"),
	请选择支付方式支付(2047,"请选择支付方式支付", "请选择支付方式支付"),
	账单不存在(2047,"账单不存在", "账单不存在"),
	没有待支付的账单或账单已支付成功_请勿重复支付(2047,"没有待支付的账单或账单已支付成功，请勿重复支付", "没有待支付的账单或账单已支付成功，请勿重复支付"),
	请输入免单理由(2047,"请输入免单理由", "请输入免单理由"),
	支付金额错误(2047,"支付金额错误", "支付金额错误"),
	线下支付失败(2047,"线下支付失败", "线下支付失败"),
	
	ORDER_CART_CACHE_WAITCALL_FAIL(2048,"缓存等叫状态的购物车明细失败", "缓存等叫状态的购物车明细失败"),
	ORDER_ORDER_ITEM_OPT_ERROR(2049,"菜品操作失败", "菜品操作失败"),
	SNACK_ORDER_DISHES_EMPTY(2050,"订单菜品为空", "订单菜品为空"),
	SNACK_ORDER_DISHES_PRICE_NOT_EXISTS(2051,"", ""),
	SNACK_ORDER_DISHES_PRICE_INCORRECT(2052,"", ""),
	SNACK_ORDER_FAIL(2053,"快速点餐下单失败", "快速点餐下单失败"),
	SNACK_ORDER_CANCEL_FAIL(2054,"订单退货失败", "订单退货失败"),
	订单取消失败(2055,"订单取消失败", "订单取消失败"),
	订单退款失败(2056,"订单退款失败", "订单退款失败"),
	订单不存在(2057,"订单不存在", "订单不存在"),
	BILL_NOT_EXISTS(2058,"账单不存在", "账单不存在"),
	账单不存在或重复(2059,"账单不存在或重复", "账单不存在或重复"),
	订单必选项修改失败(2060,"订单必选项修改失败", "订单必选项修改失败"),
	清除订单所有折扣优惠失败(2061,"清除订单所有折扣优惠失败", "清除订单所有折扣优惠失败"),
	获取打印模板失败(2062,"获取打印模板失败", "获取打印模板失败"),
	订单反结账失败(2063,"订单反结账失败", "订单反结账失败"),
	没有折扣权限或权限不够(2064,"没有折扣权限或权限不够", "没有折扣权限或权限不够"),
	邮件订阅订单报表失败(2065,"邮件订阅订单报表失败", "邮件订阅订单报表失败"),
	订单赠菜操作失败(2066,"订单赠菜操作失败", "订单赠菜操作失败"),

	/**
	 * 云平台 
	 */
    USER_FAIL(5500, "token失效", "token失效"),
    EXCEL_EXPORT_FAIL(11001, "EXCEL导出失败", "EXCEL导出失败"),
    EXCEL_EXPORT_SUCCESS(0, "EXCEL导出成功", "EXCEL导出成功"),
	PLATFORM_GOODS_CATEGORY_FAIL(11002, "商品分类创建、更新或删除失败", "商品分类创建、更新或删除失败"),
    TABLE_EXIST_FAIL(11003, "桌台已存在", "桌台已存在"),
	TABLE_AREA_EXIST_FAIL(11004, "区域已存在", "区域已存在"),
    NO_AUTHORIZATION(11005, "无权操作", "无权操作"),
    NAME_EXIST_TRUE(11006, "名称已存在", "名称已存在"),
    PLATFORM_DUPLICATE_KEY(11007, "存在重复值", "存在重复值"),
    PLATFORM_ORDER_ERROR(11008, "更改顺序错误", "更改顺序错误"),
    PLATFORM_DISHES_ERROR(11009, "菜品操作失败", "菜品操作失败"),
    PLATFORM_SPECIFICATION_ERROR(11009, "规格操作失败", "规格操作失败"),
    PLATFORM_MAKING_ERROR(11010, "做法操作失败", "做法操作失败"),
    PLATFORM_SIDE_DISH_ERROR(11011, "主配菜关系操作失败", "主配菜关系操作失败"),
    PLATFORM_DISHES_PICTURE_ERROR(11012, "图片操作失败", "图片操作失败"),
    PLATFORM_MERCHANT_NOT_EXIST(11013, "商户不存在", "商户不存在"),
    PLATFORM_MERCHANT_ERROR(11014, "商户操作失败", "商户操作失败"),
    PLATFORM_STORE_ERROR(11015, "门店操作失败", "门店操作失败"),
    PLATFORM_DEPARTMENT_ERROR(11016, "部门操作失败", "部门操作失败"),
    PLATFORM_MEAL_PERIOD_ERROR(11017, "餐段操作失败", "餐段操作失败"),
    新增或编辑销售范本失败(11018, "新增或编辑销售范本失败", "新增或编辑销售范本失败"),
	PLATFORM_IS_NOT_EXIST(11019, "商户不存在", "商户不存在"),
	PLATFORM_IS_NOT_LATEST_VERSION(11020, "不是最新版本号", "不是最新版本号"),
	PLATFORM_CODE_PARAM_MISSING(11021, "缺少必填参数", "缺少必填参数"),
	PLATFORM_USER_IS_NOT_EXIST(11022, "用户不存在", "用户不存在"),
	PLATFORM_PARAM_FORMAT_ERROR(11023, "参数格式错误", "参数格式错误"),
	PLATFORM_MCNT_BRAND_NO_BD(11024, "店铺没有绑定品牌", "店铺没有绑定品牌"),
    PERIOD_NAME_EXIST(11025, "餐段名称已存在", "餐段名称已存在"),
	PERIOD_REPEATE(11026, "餐段存在交叉", "餐段存在交叉"),
	PAKAGE_NAME_EXIST(11027, "套餐名称已存在", "套餐名称已存在"),
	PAKAGE_CODE_EXIST(11028, "套餐编码已存在", "餐段编码已存在"),
	PAKAGE_BARCODE_EXIST(11029, "套餐条形码已存在", "套餐名称已存在");



	private Integer code;
	private String msg;
	private String showMsg;

	ResultCodeMsgEnum(Integer code, String msg, String showMsg) {
		this.code = code;
		this.msg = msg;
		this.showMsg = showMsg;
	}

	public Integer getCode() {
		return code;
	}

	public String getMsg() {
		return msg;
	}
	
	public String getShowMsg(){
		return showMsg;
	}
	
	public static String getMsg(Integer code) {
		for (ResultCodeMsgEnum rcme : values()) {
			if (rcme.getCode().intValue() == code.intValue()) {
				return rcme.getMsg();
			}
		}
		return "";
	}

	public static String getShowMsg(Integer code) {
		for (ResultCodeMsgEnum rcme : values()) {
			if (rcme.getCode().intValue() == code.intValue()) {
				return rcme.getShowMsg();
			}
		}
		return "";
	}

}
