/*
Navicat MySQL Data Transfer

Source Server         : hui_project
Source Server Version : 50628
Source Host           : localhost:3306
Source Database       : hui_project

Target Server Type    : MYSQL
Target Server Version : 50628
File Encoding         : 65001

Date: 2018-05-20 22:06:02
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for console_consumer_info
-- ----------------------------
DROP TABLE IF EXISTS `console_consumer_info`;
CREATE TABLE `console_consumer_info` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `user_id` int(11) NOT NULL COMMENT '用户ID',
  `province` varchar(64) NOT NULL COMMENT '消费省份',
  `city` varchar(64) NOT NULL COMMENT '消费城市',
  `code` varchar(64) NOT NULL COMMENT '消费类别',
  `code_name` varchar(64) NOT NULL COMMENT '消费分类名',
  `parent_code` varchar(64) NOT NULL COMMENT '父消费类别',
  `parent_code_name` varchar(64) NOT NULL COMMENT '消费父类别名',
  `amount` int(11) NOT NULL COMMENT '消费金额（扩大100倍）',
  `digest` int(4) NOT NULL DEFAULT '2' COMMENT '摘要（1：收入 2：支出）',
  `consumer` varchar(64) NOT NULL COMMENT '消费者',
  `consumer_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '消费时间',
  `description` varchar(512) DEFAULT NULL COMMENT '描述',
  `status` int(4) NOT NULL DEFAULT '1' COMMENT '状态（1：已消费 2：预消费3：未消费）',
  `create_user` varchar(32) NOT NULL DEFAULT '0' COMMENT '创建者',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_user` varchar(32) NOT NULL DEFAULT '0' COMMENT '更新者',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间',
  `del_flag` int(4) NOT NULL DEFAULT '1' COMMENT '删除标志',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=292 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of console_consumer_info
-- ----------------------------
INSERT INTO `console_consumer_info` VALUES ('6', '2', '上海市', '普陀区', '0301', '租赁房房租', '03', '居住', '720000', '2', '家庭', '2018-02-11 00:00:00', '三月份四月份房租', '1', '2', '2018-02-10 23:41:19', '2', '2018-02-10 23:41:19', '1');
INSERT INTO `console_consumer_info` VALUES ('8', '2', '河南省', '鹤壁市', '0802', '其他服务', '08', '其他服务', '1150000', '2', '家庭', '2018-02-13 00:00:00', '还大姑11500', '1', '2', '2018-02-10 23:44:23', '2', '2018-02-10 23:44:23', '1');
INSERT INTO `console_consumer_info` VALUES ('9', '2', '河南省', '郑州市', '0501', '交通', '05', '交通和通信', '5900', '2', '张辉', '2018-02-12 01:20:00', '从郑州东站打车到新芒果春天苑', '1', '2', '2018-02-21 12:39:32', '2', '2018-02-21 12:39:32', '1');
INSERT INTO `console_consumer_info` VALUES ('10', '2', '河南省', '郑州市', '0404', '家庭日用杂品', '04', '生活用品及服务', '5670', '2', '张辉', '2018-02-12 10:44:00', '购买生活用品(拖把、扫把、毛巾等)', '1', '2', '2018-02-21 12:41:40', '2', '2018-02-21 12:41:40', '1');
INSERT INTO `console_consumer_info` VALUES ('11', '2', '河南省', '鹤壁市', '0802', '其他服务', '08', '其他服务', '400', '2', '张辉', '2018-02-12 20:09:00', '蚂蚁借呗利息', '1', '2', '2018-02-21 12:43:19', '2', '2018-02-21 12:43:19', '1');
INSERT INTO `console_consumer_info` VALUES ('12', '2', '河南省', '鹤壁市', '0802', '其他服务', '08', '其他服务', '2250', '2', '张辉', '2018-02-16 14:26:00', '微粒贷利息', '1', '2', '2018-02-21 12:44:29', '2', '2018-02-21 12:44:29', '1');
INSERT INTO `console_consumer_info` VALUES ('13', '2', '河南省', '鹤壁市', '0101', '食品', '01', '食品烟酒', '8800', '2', '张辉', '2018-02-17 09:30:00', '购买道口骚鸡', '1', '2', '2018-02-21 12:46:38', '2', '2018-02-21 12:46:38', '1');
INSERT INTO `console_consumer_info` VALUES ('14', '2', '河南省', '鹤壁市', '0101', '食品', '01', '食品烟酒', '12500', '2', '张辉', '2018-02-17 09:26:00', '购买一箱瑞士卷、一箱草莓', '1', '2', '2018-02-21 12:48:04', '2', '2018-02-21 12:48:04', '1');
INSERT INTO `console_consumer_info` VALUES ('15', '2', '河南省', '鹤壁市', '0101', '食品', '01', '食品烟酒', '9000', '2', '张辉', '2018-02-17 09:37:00', '一项瑞士卷、两小箱草莓（大箱草莓换的）', '1', '2', '2018-02-21 12:49:44', '2', '2018-02-21 12:49:44', '1');
INSERT INTO `console_consumer_info` VALUES ('16', '2', '上海市', '普陀区', '0801', '工资', '08', '收入', '1590650', '1', '工资', '2018-02-22 18:00:00', '2108年1月份工资', '2', '2', '2018-02-21 14:15:18', '2', '2018-02-21 14:15:18', '1');
INSERT INTO `console_consumer_info` VALUES ('17', '2', '上海市', '普陀区', '0801', '工资', '08', '收入', '227781', '1', '工资', '2018-02-21 15:00:00', '目前身上剩余的钱', '2', '2', '2018-02-21 15:09:50', '2', '2018-02-21 15:09:50', '1');
INSERT INTO `console_consumer_info` VALUES ('18', '2', '河南省', '鹤壁市', '0406', '家庭服务', '04', '生活用品及服务', '50000', '2', '李玉纳', '2018-02-16 10:11:00', '借李玉纳500元，给杜小洁小孩上礼钱', '1', '2', '2018-02-21 15:35:59', '2', '2018-02-21 15:35:59', '1');
INSERT INTO `console_consumer_info` VALUES ('19', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '101400', '2', '张纪堂', '2018-02-21 10:00:00', '鹤壁东到上海虹桥火车票', '1', '2', '2018-02-21 22:11:21', '2', '2018-02-21 22:11:21', '1');
INSERT INTO `console_consumer_info` VALUES ('20', '2', '上海市', '普陀区', '0806', '红包', '08', '收入', '2000', '1', '工资', '2018-02-22 10:00:00', '过年红包（好少）', '2', '2', '2018-02-22 20:04:13', '2', '2018-02-22 20:04:13', '1');
INSERT INTO `console_consumer_info` VALUES ('21', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1300', '2', '张辉', '2018-02-22 00:14:00', '午餐（吃的面条）', '1', '2', '2018-02-22 20:06:20', '2', '2018-02-22 20:06:20', '1');
INSERT INTO `console_consumer_info` VALUES ('22', '2', '上海市', '嘉定区', '0802', '其他服务', '08', '其他服务', '30019', '2', '张辉', '2018-02-23 08:09:00', '交通银行信用卡还款', '1', '2', '2018-02-23 20:50:46', '2', '2018-02-23 20:50:46', '1');
INSERT INTO `console_consumer_info` VALUES ('23', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '2450', '2', '张辉', '2018-02-23 09:17:00', '上海南到杭州东火车票', '1', '2', '2018-02-23 20:51:48', '2', '2018-02-23 20:51:48', '1');
INSERT INTO `console_consumer_info` VALUES ('24', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '11200', '2', '张辉', '2018-02-23 09:10:00', '杭州东到上海虹桥火车票', '1', '2', '2018-02-23 20:53:17', '2', '2018-02-23 20:53:17', '1');
INSERT INTO `console_consumer_info` VALUES ('25', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1000', '2', '张辉', '2018-02-23 00:14:00', '午餐（吃的面条）', '1', '2', '2018-02-23 20:56:46', '2', '2018-02-23 20:56:46', '1');
INSERT INTO `console_consumer_info` VALUES ('26', '2', '上海市', '普陀区', '0301', '食品', '01', '食品烟酒', '3993', '2', '张辉', '2018-02-23 19:39:00', '食品（鸡蛋、西红柿、挂面、青菜、香菜），地点：世纪联华（中环店）', '1', '2', '2018-02-23 21:01:35', '2', '2018-02-23 21:01:35', '1');
INSERT INTO `console_consumer_info` VALUES ('27', '2', '上海市', '嘉定区', '0805', '退款', '08', '收入', '12050', '1', '火车票退票', '2018-02-24 13:00:00', '火车票退票', '2', '2', '2018-02-25 00:12:54', '2', '2018-02-25 00:12:54', '1');
INSERT INTO `console_consumer_info` VALUES ('28', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1000', '2', '张辉', '2018-02-24 00:13:00', '午餐（吃的面条）', '1', '2', '2018-02-25 00:13:57', '2', '2018-02-25 00:13:57', '1');
INSERT INTO `console_consumer_info` VALUES ('29', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '10970', '2', '张梓瞳', '2018-02-25 10:20:00', '购买洗头膏、纸尿裤', '1', '2', '2018-02-25 12:56:58', '2', '2018-02-25 12:56:58', '1');
INSERT INTO `console_consumer_info` VALUES ('30', '2', '上海市', '普陀区', '0304', '其他', '03', '居住', '412914', '2', '李玉纳', '2018-02-25 00:37:00', '房贷3379.23元 手机白条249.92元 陈岩小孩礼钱500', '1', '2', '2018-02-25 12:59:16', '2', '2018-02-25 12:59:16', '1');
INSERT INTO `console_consumer_info` VALUES ('31', '2', '上海市', '普陀区', '0802', '其他服务', '08', '其他服务', '104580', '2', '张辉', '2018-02-25 00:38:00', '招商银行信用卡还款', '1', '2', '2018-02-25 13:00:42', '2', '2018-02-25 13:00:42', '1');
INSERT INTO `console_consumer_info` VALUES ('32', '2', '上海市', '普陀区', '0802', '其他服务', '08', '其他服务', '95895', '2', '张辉', '2018-02-25 00:39:00', '支付宝花呗还款', '1', '2', '2018-02-25 13:01:21', '2', '2018-02-25 13:01:21', '1');
INSERT INTO `console_consumer_info` VALUES ('33', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '6025', '2', '张辉', '2018-02-25 19:43:00', '购买生活日用品（白菜、蒜苗、面包、土豆、洋葱、虾片、肉、大葱）', '1', '2', '2018-02-25 20:53:00', '2', '2018-02-25 20:53:00', '1');
INSERT INTO `console_consumer_info` VALUES ('34', '2', '上海市', '普陀区', '0403', '家用纺织品', '04', '生活用品及服务', '2980', '2', '李玉纳', '2018-02-27 11:11:00', '儿童枕头（拼多多）', '1', '2', '2018-02-27 16:29:23', '2', '2018-02-27 16:29:23', '1');
INSERT INTO `console_consumer_info` VALUES ('35', '2', '上海市', '普陀区', '0802', '其他服务', '08', '其他服务', '6200', '2', '张辉', '2018-02-27 07:44:00', '信用卡套现手续费', '1', '2', '2018-02-27 19:49:31', '2', '2018-02-27 19:49:31', '1');
INSERT INTO `console_consumer_info` VALUES ('36', '2', '上海市', '普陀区', '0802', '其他服务', '08', '其他服务', '4400', '2', '张辉', '2018-02-27 19:52:00', '蚂蚁借吧利息', '1', '2', '2018-02-27 19:52:55', '2', '2018-02-27 19:52:55', '1');
INSERT INTO `console_consumer_info` VALUES ('37', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '600', '2', '张辉', '2018-03-01 11:24:00', '西红柿、香菜', '1', '2', '2018-03-02 15:02:22', '2', '2018-03-02 15:02:22', '1');
INSERT INTO `console_consumer_info` VALUES ('38', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1720', '2', '张辉', '2018-03-01 19:01:00', '橙子、橘子', '1', '2', '2018-03-02 15:04:27', '2', '2018-03-02 15:04:27', '1');
INSERT INTO `console_consumer_info` VALUES ('39', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1200', '2', '张辉', '2018-03-01 19:03:00', '香蕉', '1', '2', '2018-03-02 15:05:01', '2', '2018-03-02 15:05:01', '1');
INSERT INTO `console_consumer_info` VALUES ('40', '2', '上海市', '普陀区', '0502', '通信', '05', '交通和通信', '3000', '2', '张辉', '2018-03-02 13:42:00', '手机充值', '1', '2', '2018-03-02 15:06:21', '2', '2018-03-02 15:06:21', '1');
INSERT INTO `console_consumer_info` VALUES ('41', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '2690', '2', '张辉', '2018-03-02 18:00:00', '9斤橙子', '1', '2', '2018-03-02 18:46:09', '2', '2018-03-02 18:46:09', '1');
INSERT INTO `console_consumer_info` VALUES ('42', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '20983', '2', '张辉', '2018-03-02 20:59:00', '虾、青椒、黄油、玉米肠、洋白菜、丑橘、方便面、汤圆等', '1', '2', '2018-03-04 10:02:28', '2', '2018-03-04 10:02:28', '1');
INSERT INTO `console_consumer_info` VALUES ('43', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '590', '2', '张辉', '2018-03-03 16:27:00', '三个夹菜烧饼', '1', '2', '2018-03-04 10:12:41', '2', '2018-03-04 10:12:41', '1');
INSERT INTO `console_consumer_info` VALUES ('44', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '500', '2', '张辉', '2018-03-03 16:36:00', '面条', '1', '2', '2018-03-04 10:13:31', '2', '2018-03-04 10:13:31', '1');
INSERT INTO `console_consumer_info` VALUES ('45', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '8126', '2', '张辉', '2018-03-03 17:27:00', '香油、变蛋、鸡蛋糕、橙子、豆腐、酱鸭、十三香、馒头、包子等', '1', '2', '2018-03-04 10:17:10', '2', '2018-03-04 10:17:10', '1');
INSERT INTO `console_consumer_info` VALUES ('46', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '2488', '2', '张辉', '2018-03-03 18:23:00', '草莓、蓝莓', '1', '2', '2018-03-04 10:18:18', '2', '2018-03-04 10:18:18', '1');
INSERT INTO `console_consumer_info` VALUES ('47', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1580', '2', '张辉', '2018-03-03 23:53:00', '大蒜', '1', '2', '2018-03-04 10:19:25', '2', '2018-03-04 10:19:25', '1');
INSERT INTO `console_consumer_info` VALUES ('48', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1360', '2', '张辉', '2018-03-04 00:15:00', '大葱', '1', '2', '2018-03-04 10:19:58', '2', '2018-03-04 10:19:58', '1');
INSERT INTO `console_consumer_info` VALUES ('49', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '10000', '2', '张辉', '2018-03-04 14:00:00', '购买地铁卡两张', '1', '2', '2018-03-04 21:20:57', '2', '2018-03-04 21:20:57', '1');
INSERT INTO `console_consumer_info` VALUES ('50', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '2000', '2', '张辉', '2018-03-04 16:55:00', '购买摩拜单车月卡', '1', '2', '2018-03-04 21:22:46', '2', '2018-03-04 21:22:46', '1');
INSERT INTO `console_consumer_info` VALUES ('51', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '3917', '2', '张辉', '2018-03-04 20:02:00', '白菜、瞳瞳牙刷、零食', '1', '2', '2018-03-04 21:24:25', '2', '2018-03-04 21:24:25', '1');
INSERT INTO `console_consumer_info` VALUES ('52', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1000', '2', '张辉', '2018-03-06 00:10:00', '午餐（面条）', '1', '2', '2018-03-08 08:01:18', '2', '2018-03-08 08:01:18', '1');
INSERT INTO `console_consumer_info` VALUES ('53', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '990', '2', '张辉', '2018-03-07 00:15:00', '午餐（面条）', '1', '2', '2018-03-08 08:02:04', '2', '2018-03-08 08:02:04', '1');
INSERT INTO `console_consumer_info` VALUES ('54', '2', '上海市', '普陀区', '0406', '家庭服务', '04', '生活用品及服务', '100000', '2', '张纪堂', '2018-03-07 07:00:00', '爸妈生活费（二月）', '1', '2', '2018-03-08 08:03:12', '2', '2018-03-08 08:03:12', '1');
INSERT INTO `console_consumer_info` VALUES ('55', '2', '上海市', '普陀区', '0303', '水、电、燃料', '03', '居住', '3729', '2', '张辉', '2018-03-08 08:05:00', '三月电费', '1', '2', '2018-03-08 08:07:44', '2', '2018-03-08 08:07:44', '1');
INSERT INTO `console_consumer_info` VALUES ('56', '2', '上海市', '普陀区', '0303', '水、电、燃料', '03', '居住', '13800', '2', '张辉', '2018-03-08 08:06:00', '2018上半年有线电视费用', '1', '2', '2018-03-08 08:08:34', '2', '2018-03-08 08:08:34', '1');
INSERT INTO `console_consumer_info` VALUES ('57', '2', '上海市', '普陀区', '0406', '家庭服务', '04', '生活用品及服务', '3800', '2', '李玉纳', '2018-03-08 09:11:00', '三八妇女节 给李玉纳38', '1', '2', '2018-03-09 08:17:29', '2', '2018-03-09 08:17:29', '1');
INSERT INTO `console_consumer_info` VALUES ('58', '2', '上海市', '普陀区', '0406', '家庭服务', '04', '生活用品及服务', '3800', '2', '张银荣', '2018-03-08 09:11:00', '三八妇女节，给老妈38红包', '1', '2', '2018-03-09 08:18:16', '2', '2018-03-09 08:18:16', '1');
INSERT INTO `console_consumer_info` VALUES ('59', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1000', '2', '张辉', '2018-03-08 00:16:00', '午餐（面条）', '1', '2', '2018-03-09 08:22:17', '2', '2018-03-09 08:22:17', '1');
INSERT INTO `console_consumer_info` VALUES ('60', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '984', '2', '张辉', '2018-03-09 00:14:00', '午餐（面条）', '1', '2', '2018-03-09 21:50:04', '2', '2018-03-09 21:50:04', '1');
INSERT INTO `console_consumer_info` VALUES ('61', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '12981', '2', '张梓瞳', '2018-03-10 08:48:00', '纸尿裤两包110片', '1', '2', '2018-03-10 10:04:26', '2', '2018-03-10 10:04:26', '1');
INSERT INTO `console_consumer_info` VALUES ('62', '2', '上海市', '静安区', '0501', '交通', '05', '交通和通信', '12850', '2', '张辉', '2018-03-12 13:28:00', '回郑州签租房合同', '1', '2', '2018-03-12 08:04:10', '2', '2018-03-12 08:04:10', '1');
INSERT INTO `console_consumer_info` VALUES ('63', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '23050', '2', '张辉', '2018-03-10 16:36:00', '郑州到上海火车票', '1', '2', '2018-03-12 08:05:28', '2', '2018-03-12 08:05:28', '1');
INSERT INTO `console_consumer_info` VALUES ('64', '2', '河南省', '郑州市', '0407', '其他', '04', '生活用品及服务', '300', '2', '张辉', '2018-03-11 10:05:00', '打印租房合同三份', '1', '2', '2018-03-12 08:07:00', '2', '2018-03-12 08:07:00', '1');
INSERT INTO `console_consumer_info` VALUES ('65', '2', '上海市', '静安区', '0501', '交通', '05', '交通和通信', '5000', '2', '张辉', '2018-03-10 19:00:00', '地铁卡充值', '1', '2', '2018-03-12 08:08:41', '2', '2018-03-12 08:08:41', '1');
INSERT INTO `console_consumer_info` VALUES ('66', '2', '上海市', '静安区', '0105', '其他', '01', '食品烟酒', '800', '2', '张辉', '2018-03-10 18:00:00', '路上食品', '1', '2', '2018-03-12 08:09:31', '2', '2018-03-12 08:09:31', '1');
INSERT INTO `console_consumer_info` VALUES ('67', '2', '河南省', '郑州市', '0501', '交通', '05', '交通和通信', '1000', '2', '张辉', '2018-03-11 18:00:00', '绿城通卡充值', '1', '2', '2018-03-12 08:10:23', '2', '2018-03-12 08:10:23', '1');
INSERT INTO `console_consumer_info` VALUES ('68', '2', '河南省', '郑州市', '0101', '食品', '01', '食品烟酒', '1190', '2', '李玉纳', '2018-03-11 00:40:00', '拼多多购买零食（找我代付款）', '1', '2', '2018-03-12 08:12:07', '2', '2018-03-12 08:12:07', '1');
INSERT INTO `console_consumer_info` VALUES ('69', '2', '河南省', '郑州市', '0101', '食品', '01', '食品烟酒', '1580', '2', '李玉纳', '2018-03-11 18:05:00', '拼多多购买零食（找我代付款）', '1', '2', '2018-03-12 08:13:02', '2', '2018-03-12 08:13:02', '1');
INSERT INTO `console_consumer_info` VALUES ('70', '2', '河南省', '郑州市', '0101', '食品', '01', '食品烟酒', '1490', '2', '李玉纳', '2018-03-11 18:06:00', '拼多多购买零食（找我代付款）', '1', '2', '2018-03-12 08:14:01', '2', '2018-03-12 08:14:01', '1');
INSERT INTO `console_consumer_info` VALUES ('71', '3', '河南省', '郑州市', '0305', '出租房房租', '03', '居住', '30000', '1', '张梓瞳', '2018-03-10 00:54:00', '租房者押金', '2', '3', '2018-03-12 08:19:23', '3', '2018-03-12 08:19:23', '1');
INSERT INTO `console_consumer_info` VALUES ('72', '3', '河南省', '郑州市', '0305', '出租房房租', '03', '居住', '820000', '1', '张梓瞳', '2018-03-11 11:09:00', '押一付三，另100元燃气费', '2', '3', '2018-03-12 08:20:35', '3', '2018-03-12 08:20:35', '1');
INSERT INTO `console_consumer_info` VALUES ('73', '3', '河南省', '郑州市', '0302', '住房保养、维修及管理', '03', '居住', '6000', '2', '张辉', '2018-03-11 09:51:00', '办理小区门禁卡两张', '1', '3', '2018-03-12 08:21:49', '3', '2018-03-12 08:21:49', '1');
INSERT INTO `console_consumer_info` VALUES ('74', '3', '河南省', '郑州市', '0302', '住房保养、维修及管理', '03', '居住', '169700', '2', '张辉', '2018-03-11 09:53:00', '2018年度物业费', '1', '3', '2018-03-12 08:22:54', '3', '2018-03-12 08:22:54', '1');
INSERT INTO `console_consumer_info` VALUES ('75', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1540', '2', '李玉纳', '2018-03-12 08:57:00', '拼多多购买零食（找我代付款）', '1', '2', '2018-03-13 08:10:00', '2', '2018-03-13 08:10:00', '1');
INSERT INTO `console_consumer_info` VALUES ('76', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '680', '2', '李玉纳', '2018-03-12 08:58:00', '拼多多购买零食（找我代付款）', '1', '2', '2018-03-13 08:10:34', '2', '2018-03-13 08:10:34', '1');
INSERT INTO `console_consumer_info` VALUES ('77', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '570', '2', '李玉纳', '2018-03-12 20:25:00', '拼多多购买零食（找我代付款）', '1', '2', '2018-03-13 08:11:04', '2', '2018-03-13 08:11:04', '1');
INSERT INTO `console_consumer_info` VALUES ('78', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '4800', '2', '李玉纳', '2018-03-12 09:07:00', '淘宝亲情号购买蓝莓（请我代付款）', '1', '2', '2018-03-13 08:12:46', '2', '2018-03-13 08:12:46', '1');
INSERT INTO `console_consumer_info` VALUES ('79', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '800', '2', '张辉', '2018-03-12 00:20:00', '午餐（面条）', '1', '2', '2018-03-13 08:13:22', '2', '2018-03-13 08:13:22', '1');
INSERT INTO `console_consumer_info` VALUES ('80', '2', '上海市', '嘉定区', '0601', '教育', '06', '教育、文化和娱乐', '21360', '2', '张辉', '2018-03-12 15:38:00', '购买岩土工程师基础考试用书', '1', '2', '2018-03-13 08:14:14', '2', '2018-03-13 08:14:14', '1');
INSERT INTO `console_consumer_info` VALUES ('81', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '2870', '2', '张辉', '2018-03-13 11:11:00', '大蒜（拼多多）', '1', '2', '2018-03-16 07:54:43', '2', '2018-03-16 07:54:43', '1');
INSERT INTO `console_consumer_info` VALUES ('82', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1000', '2', '张辉', '2018-03-13 00:13:00', '午餐（面条）', '1', '2', '2018-03-16 07:55:34', '2', '2018-03-16 07:55:34', '1');
INSERT INTO `console_consumer_info` VALUES ('83', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1610', '2', '张辉', '2018-03-13 16:10:00', '购买草莓', '1', '2', '2018-03-16 07:56:33', '2', '2018-03-16 07:56:33', '1');
INSERT INTO `console_consumer_info` VALUES ('84', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1000', '2', '张辉', '2018-03-14 00:10:00', '面条', '1', '2', '2018-03-16 07:57:05', '2', '2018-03-16 07:57:05', '1');
INSERT INTO `console_consumer_info` VALUES ('85', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1450', '2', '张辉', '2018-03-15 11:17:00', '午餐（外卖）', '1', '2', '2018-03-16 07:58:03', '2', '2018-03-16 07:58:03', '1');
INSERT INTO `console_consumer_info` VALUES ('86', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '2690', '2', '张辉', '2018-03-15 22:20:00', '购买橙子', '1', '2', '2018-03-16 07:58:37', '2', '2018-03-16 07:58:37', '1');
INSERT INTO `console_consumer_info` VALUES ('87', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1290', '2', '李玉纳', '2018-03-13 18:37:00', '拼多多购买零食（请我代付款）', '1', '2', '2018-03-16 08:01:35', '2', '2018-03-16 08:01:35', '1');
INSERT INTO `console_consumer_info` VALUES ('88', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1090', '2', '李玉纳', '2018-03-13 21:43:00', '拼多多购买零食（请我代付款）', '1', '2', '2018-03-16 08:02:35', '2', '2018-03-16 08:02:35', '1');
INSERT INTO `console_consumer_info` VALUES ('89', '2', '上海市', '嘉定区', '0503', '其他', '05', '交通和通信', '1800', '2', '张辉', '2018-03-14 00:27:00', '邮寄燃气卡（上海到郑州）', '1', '2', '2018-03-16 08:03:44', '2', '2018-03-16 08:03:44', '1');
INSERT INTO `console_consumer_info` VALUES ('90', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '500', '2', '张辉', '2018-03-15 08:30:00', '购买车票（没有带地铁卡）', '1', '2', '2018-03-16 08:05:21', '2', '2018-03-16 08:05:21', '1');
INSERT INTO `console_consumer_info` VALUES ('91', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1000', '2', '张辉', '2018-03-16 00:20:00', '午餐（面条）', '1', '2', '2018-03-19 08:22:03', '2', '2018-03-19 08:22:03', '1');
INSERT INTO `console_consumer_info` VALUES ('92', '2', '上海市', '普陀区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '500', '2', '张辉', '2018-03-16 22:11:00', '看电影购买饮料', '1', '2', '2018-03-19 08:22:52', '2', '2018-03-19 08:22:52', '1');
INSERT INTO `console_consumer_info` VALUES ('93', '2', '上海市', '普陀区', '0701', '医疗器具及药品', '07', '医疗保健', '9360', '2', '张辉', '2018-03-17 00:00:00', '购买银杏叶片药片品', '1', '2', '2018-03-19 08:24:00', '2', '2018-03-19 08:24:00', '1');
INSERT INTO `console_consumer_info` VALUES ('94', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '500', '2', '张辉', '2018-03-17 17:19:00', '购买冰淇淋两个', '1', '2', '2018-03-19 08:24:57', '2', '2018-03-19 08:24:57', '1');
INSERT INTO `console_consumer_info` VALUES ('95', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1351', '2', '张辉', '2018-03-17 00:59:00', '两瓶红茶，两袋鸡蛋松，韭菜一把', '1', '2', '2018-03-20 08:15:26', '2', '2018-03-20 08:15:26', '1');
INSERT INTO `console_consumer_info` VALUES ('96', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1074', '2', '张辉', '2018-03-18 15:26:00', '虾仁一袋等', '1', '2', '2018-03-20 08:16:51', '2', '2018-03-20 08:16:51', '1');
INSERT INTO `console_consumer_info` VALUES ('97', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '9630', '2', '张辉', '2018-03-18 19:19:00', '大米一袋，生抽两瓶，醋一壶', '1', '2', '2018-03-20 08:17:49', '2', '2018-03-20 08:17:49', '1');
INSERT INTO `console_consumer_info` VALUES ('98', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1893', '2', '张辉', '2018-03-18 20:36:00', '小米，西红柿等', '1', '2', '2018-03-20 08:19:16', '2', '2018-03-20 08:19:16', '1');
INSERT INTO `console_consumer_info` VALUES ('99', '2', '上海市', '普陀区', '0603', '其他', '06', '教育、文化和娱乐', '599', '2', '张纪堂', '2018-03-18 21:18:00', '鱼料', '1', '2', '2018-03-20 08:20:24', '2', '2018-03-20 08:20:24', '1');
INSERT INTO `console_consumer_info` VALUES ('100', '2', '上海市', '静安区', '0603', '其他', '06', '教育、文化和娱乐', '1280', '2', '张纪堂', '2018-03-18 22:33:00', '鱼料', '1', '2', '2018-03-20 08:20:58', '2', '2018-03-20 08:20:58', '1');
INSERT INTO `console_consumer_info` VALUES ('101', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1500', '2', '张辉', '2018-03-19 00:14:00', '午餐（面条）', '1', '2', '2018-03-20 08:21:29', '2', '2018-03-20 08:21:29', '1');
INSERT INTO `console_consumer_info` VALUES ('102', '2', '上海市', '嘉定区', '0402', '家用器具', '04', '生活用品及服务', '990', '2', '张辉', '2018-03-20 00:00:00', '刷锅清洗球', '1', '2', '2018-03-22 08:10:03', '2', '2018-03-22 08:10:03', '1');
INSERT INTO `console_consumer_info` VALUES ('103', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-03-20 00:18:00', '午餐（面条）', '1', '2', '2018-03-22 08:10:51', '2', '2018-03-22 08:10:51', '1');
INSERT INTO `console_consumer_info` VALUES ('104', '2', '上海市', '嘉定区', '0404', '家庭日用杂品', '04', '生活用品及服务', '390', '2', '张辉', '2018-03-20 14:44:00', '厨房沥水收纳神器', '1', '2', '2018-03-22 08:12:00', '2', '2018-03-22 08:12:00', '1');
INSERT INTO `console_consumer_info` VALUES ('105', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '550', '2', '张辉', '2018-03-20 17:24:00', '5斤大蒜', '1', '2', '2018-03-22 08:12:41', '2', '2018-03-22 08:12:41', '1');
INSERT INTO `console_consumer_info` VALUES ('106', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '25050', '2', '李玉纳', '2018-03-20 23:52:00', 'vivo手机贷款', '1', '2', '2018-03-22 08:13:32', '2', '2018-03-22 08:13:32', '1');
INSERT INTO `console_consumer_info` VALUES ('107', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1500', '2', '张辉', '2018-03-21 00:12:00', '午餐（米线）', '1', '2', '2018-03-22 08:14:11', '2', '2018-03-22 08:14:11', '1');
INSERT INTO `console_consumer_info` VALUES ('108', '2', '上海市', '普陀区', '0404', '家庭日用杂品', '04', '生活用品及服务', '1380', '2', '张辉', '2018-03-21 21:57:00', '泡酒玻璃瓶', '1', '2', '2018-03-22 08:14:59', '2', '2018-03-22 08:14:59', '1');
INSERT INTO `console_consumer_info` VALUES ('109', '2', '上海市', '普陀区', '0201', '衣类', '02', '衣着', '7900', '2', '张辉', '2018-03-21 23:10:00', '娜娜内衣', '1', '2', '2018-03-22 08:15:48', '2', '2018-03-22 08:15:48', '1');
INSERT INTO `console_consumer_info` VALUES ('110', '2', '上海市', '嘉定区', '0801', '工资', '08', '收入', '1590650', '1', '工资', '2018-03-20 17:00:00', '2018年2月份工资', '2', '2', '2018-03-22 08:17:48', '2', '2018-03-22 08:17:48', '1');
INSERT INTO `console_consumer_info` VALUES ('111', '2', '上海市', '普陀区', '0404', '家庭日用杂品', '04', '生活用品及服务', '190', '2', '张纪堂', '2018-03-21 20:57:00', '购买弹簧秤，请我代付款', '1', '2', '2018-03-22 08:19:20', '2', '2018-03-22 08:19:20', '1');
INSERT INTO `console_consumer_info` VALUES ('112', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1500', '2', '张辉', '2018-03-22 00:18:00', '午餐（米饭）', '1', '2', '2018-03-22 22:37:42', '2', '2018-03-22 22:37:42', '1');
INSERT INTO `console_consumer_info` VALUES ('113', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '7970', '2', '张辉', '2018-03-22 13:44:00', '食用油一壶，小麦粉两袋', '1', '2', '2018-03-22 22:41:23', '2', '2018-03-22 22:41:23', '1');
INSERT INTO `console_consumer_info` VALUES ('114', '2', '上海市', '普陀区', '0302', '住房保养、维修及管理', '03', '居住', '60000', '2', '张辉', '2018-03-24 20:00:00', '房租押金200元，2018年度物业费400元', '1', '2', '2018-03-25 21:52:38', '2', '2018-03-25 21:52:38', '1');
INSERT INTO `console_consumer_info` VALUES ('115', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-03-23 00:19:00', '午餐（面条）', '1', '2', '2018-03-25 21:53:41', '2', '2018-03-25 21:53:41', '1');
INSERT INTO `console_consumer_info` VALUES ('116', '2', '上海市', '嘉定区', '0106', '水果', '01', '食品烟酒', '838', '2', '张辉', '2018-03-23 19:13:00', '购买香蕉，十元三斤', '1', '2', '2018-03-25 21:56:01', '2', '2018-03-25 21:56:01', '1');
INSERT INTO `console_consumer_info` VALUES ('117', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '990', '2', '张银荣', '2018-03-24 00:46:00', '远视眼睛', '1', '2', '2018-03-25 21:59:01', '2', '2018-03-25 21:59:01', '1');
INSERT INTO `console_consumer_info` VALUES ('118', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1000', '2', '张辉', '2018-03-25 11:00:00', '购买面条', '1', '2', '2018-03-25 21:59:57', '2', '2018-03-25 21:59:57', '1');
INSERT INTO `console_consumer_info` VALUES ('119', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '26150', '2', '张纪堂', '2018-03-25 13:41:00', '购买上海到鹤壁火车票，硬卧下铺', '1', '2', '2018-03-25 22:01:06', '2', '2018-03-25 22:01:06', '1');
INSERT INTO `console_consumer_info` VALUES ('120', '2', '上海市', '普陀区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '1500', '2', '张辉', '2018-03-25 20:23:00', '购买脸盆一个（3元），酸奶5盒（12元）', '1', '2', '2018-03-25 22:02:28', '2', '2018-03-25 22:02:28', '1');
INSERT INTO `console_consumer_info` VALUES ('121', '2', '上海市', '普陀区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '150', '2', '张辉', '2018-03-25 08:34:00', '购买小盒冰红茶', '1', '2', '2018-03-25 22:04:19', '2', '2018-03-25 22:04:19', '1');
INSERT INTO `console_consumer_info` VALUES ('122', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1300', '2', '张辉', '2018-03-26 00:14:00', '午餐（面条）', '1', '2', '2018-03-26 21:01:06', '2', '2018-03-26 21:01:06', '1');
INSERT INTO `console_consumer_info` VALUES ('123', '2', '上海市', '普陀区', '0406', '家庭服务', '04', '生活用品及服务', '100000', '2', '张纪堂', '2018-03-26 09:16:00', '爸妈生活费（三月）', '1', '2', '2018-03-26 21:03:54', '2', '2018-03-26 21:03:54', '1');
INSERT INTO `console_consumer_info` VALUES ('124', '2', '上海市', '嘉定区', '0107', '蔬菜', '01', '食品烟酒', '1660', '2', '张辉', '2018-03-27 23:10:00', '购买洋葱', '1', '2', '2018-03-29 08:07:06', '2', '2018-03-29 08:07:06', '1');
INSERT INTO `console_consumer_info` VALUES ('125', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-03-29 00:17:00', '午餐（面条）', '1', '2', '2018-03-29 12:41:21', '2', '2018-03-29 12:41:21', '1');
INSERT INTO `console_consumer_info` VALUES ('126', '2', '上海市', '嘉定区', '0407', '其他', '04', '生活用品及服务', '219406', '2', '张辉', '2018-03-29 15:27:00', '使用本系统前消费的金额', '1', '2', '2018-03-29 13:37:19', '2', '2018-03-29 13:37:19', '1');
INSERT INTO `console_consumer_info` VALUES ('127', '2', '上海市', '普陀区', '0502', '通信', '05', '交通和通信', '4995', '2', '张纪堂', '2018-03-29 19:00:00', '手机话费充值', '1', '2', '2018-03-30 09:49:17', '2', '2018-03-30 09:49:17', '1');
INSERT INTO `console_consumer_info` VALUES ('128', '2', '上海市', '普陀区', '0303', '水、电、燃料', '03', '居住', '23700', '2', '张辉', '2018-03-29 19:54:00', '1/2月份燃气费', '1', '2', '2018-03-30 09:50:35', '2', '2018-03-30 09:50:35', '1');
INSERT INTO `console_consumer_info` VALUES ('129', '2', '上海市', '普陀区', '0502', '通信', '05', '交通和通信', '4985', '2', '张辉', '2018-03-29 19:59:00', '手机话费充值', '1', '2', '2018-03-30 09:51:19', '2', '2018-03-30 09:51:19', '1');
INSERT INTO `console_consumer_info` VALUES ('130', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '24450', '2', '张银荣', '2018-03-30 09:22:00', '购买上海到鹤壁火车票，硬卧上铺', '1', '2', '2018-03-30 09:52:51', '2', '2018-03-30 09:52:51', '1');
INSERT INTO `console_consumer_info` VALUES ('131', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-03-30 00:27:00', '午餐（面条）', '1', '2', '2018-03-30 15:00:16', '2', '2018-03-30 15:00:16', '1');
INSERT INTO `console_consumer_info` VALUES ('132', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '6408', '2', '张辉', '2018-03-31 17:36:00', '购买肉、饼干、养乐多、生姜', '1', '2', '2018-04-02 09:10:49', '2', '2018-04-02 09:10:49', '1');
INSERT INTO `console_consumer_info` VALUES ('133', '2', '上海市', '普陀区', '0601', '教育', '06', '教育、文化和娱乐', '10000', '2', '张梓瞳', '2018-03-31 15:37:00', '办理少儿读书证押金', '1', '2', '2018-04-02 09:12:00', '2', '2018-04-02 09:12:00', '1');
INSERT INTO `console_consumer_info` VALUES ('134', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '68826', '2', '张梓瞳', '2018-04-01 08:54:00', '购买奶粉4罐', '1', '2', '2018-04-02 09:13:59', '2', '2018-04-02 09:13:59', '1');
INSERT INTO `console_consumer_info` VALUES ('135', '2', '上海市', '静安区', '0405', '个人', '04', '生活及服务', '14435', '2', '张梓瞳', '2018-04-01 09:23:00', '购买奶粉一罐', '1', '2', '2018-04-02 09:14:35', '2', '2018-04-02 09:14:35', '1');
INSERT INTO `console_consumer_info` VALUES ('136', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '12850', '2', '张辉', '2018-04-01 13:38:00', '购买上海到郑州火车票，硬座', '1', '2', '2018-04-02 09:16:07', '2', '2018-04-02 09:16:07', '1');
INSERT INTO `console_consumer_info` VALUES ('137', '2', '上海市', '嘉定区', '0405', '个人', '04', '生活及服务', '2590', '2', '张纪堂', '2018-04-02 09:39:00', '折叠凳子马扎', '1', '2', '2018-04-02 09:41:44', '2', '2018-04-02 09:41:44', '1');
INSERT INTO `console_consumer_info` VALUES ('138', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-02 00:10:00', '午餐（面条）', '1', '2', '2018-04-02 19:50:05', '2', '2018-04-02 19:50:05', '1');
INSERT INTO `console_consumer_info` VALUES ('139', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '22250', '2', '张辉', '2018-04-02 14:04:00', '火车郑州到上海，上铺', '1', '2', '2018-04-02 19:50:56', '2', '2018-04-02 19:50:56', '1');
INSERT INTO `console_consumer_info` VALUES ('140', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1100', '2', '李玉纳', '2018-04-02 20:29:00', '晚餐，酸辣粉，打包', '1', '2', '2018-04-03 09:11:24', '2', '2018-04-03 09:11:24', '1');
INSERT INTO `console_consumer_info` VALUES ('141', '2', '上海市', '普陀区', '0805', '退款', '08', '收入', '1500', '1', '张辉', '2018-04-02 22:52:00', '给李玉纳购买的衣服，后来降价，退的差价', '2', '2', '2018-04-03 09:12:44', '2', '2018-04-03 09:12:44', '1');
INSERT INTO `console_consumer_info` VALUES ('142', '2', '上海市', '普陀区', '0303', '水、电、燃料', '03', '居住', '40000', '2', '张纪堂', '2018-04-03 08:22:00', '鹤壁老家电费，预交400元', '1', '2', '2018-04-03 09:15:12', '2', '2018-04-03 09:15:12', '1');
INSERT INTO `console_consumer_info` VALUES ('143', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '1400', '2', '张辉', '2018-04-03 08:57:00', '购买摩拜单车月卡', '1', '2', '2018-04-03 09:15:51', '2', '2018-04-03 09:15:51', '1');
INSERT INTO `console_consumer_info` VALUES ('144', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-03 00:06:00', '午餐（面条）', '1', '2', '2018-04-03 17:55:42', '2', '2018-04-03 17:55:42', '1');
INSERT INTO `console_consumer_info` VALUES ('145', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '50600', '2', '张纪堂', '2018-04-03 17:53:00', '鹤壁到上海，卧铺', '1', '2', '2018-04-03 17:56:44', '2', '2018-04-03 17:56:44', '1');
INSERT INTO `console_consumer_info` VALUES ('146', '2', '上海市', '嘉定区', '0502', '通信', '05', '交通和通信', '10000', '2', '张辉', '2018-04-03 18:40:00', '手机话费充值', '1', '2', '2018-04-04 09:34:15', '2', '2018-04-04 09:34:15', '1');
INSERT INTO `console_consumer_info` VALUES ('147', '2', '上海市', '普陀区', '0108', '调料', '01', '食品烟酒', '2960', '2', '张辉', '2018-04-03 21:25:00', '火锅底料，大红袍，400g三袋', '1', '2', '2018-04-04 09:36:55', '2', '2018-04-04 09:36:55', '1');
INSERT INTO `console_consumer_info` VALUES ('148', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '2350', '2', '张辉', '2018-04-04 09:24:00', '鹤壁到郑州火车票，硬座', '1', '2', '2018-04-04 09:37:40', '2', '2018-04-04 09:37:40', '1');
INSERT INTO `console_consumer_info` VALUES ('149', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-04 00:10:00', '午餐（面条）', '1', '2', '2018-04-04 17:08:30', '2', '2018-04-04 17:08:30', '1');
INSERT INTO `console_consumer_info` VALUES ('150', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '2000', '2', '张纪堂', '2018-04-04 18:44:00', '东明 万痛筋骨贴', '1', '2', '2018-04-04 21:04:06', '2', '2018-04-04 21:04:06', '1');
INSERT INTO `console_consumer_info` VALUES ('151', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '1300', '2', '张纪堂', '2018-04-04 19:48:00', '京威赤练红虫（浓香）', '1', '2', '2018-04-04 21:05:18', '2', '2018-04-04 21:05:18', '1');
INSERT INTO `console_consumer_info` VALUES ('152', '2', '上海市', '普陀区', '0402', '家用器具', '04', '生活用品及服务', '15900', '2', '张辉', '2018-04-04 23:48:00', '购买电饭煲，苏泊尔', '1', '2', '2018-04-05 14:22:38', '2', '2018-04-05 14:22:38', '1');
INSERT INTO `console_consumer_info` VALUES ('153', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '650', '2', '张纪堂', '2018-04-05 17:55:00', '洗车用水桶', '1', '2', '2018-04-05 19:24:15', '2', '2018-04-05 19:24:15', '1');
INSERT INTO `console_consumer_info` VALUES ('154', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '1380', '2', '张纪堂', '2018-04-05 17:56:00', '黑头鲜活红虫', '1', '2', '2018-04-05 19:25:14', '2', '2018-04-05 19:25:14', '1');
INSERT INTO `console_consumer_info` VALUES ('155', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '1180', '2', '张纪堂', '2018-04-05 19:12:00', '野战蓝鲫鱼饵', '1', '2', '2018-04-05 19:26:11', '2', '2018-04-05 19:26:11', '1');
INSERT INTO `console_consumer_info` VALUES ('156', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '990', '2', '张纪堂', '2018-04-05 19:57:00', '多功能不锈钢钓鱼杆支架', '1', '2', '2018-04-05 20:28:40', '2', '2018-04-05 20:28:40', '1');
INSERT INTO `console_consumer_info` VALUES ('157', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '200', '2', '张辉', '2018-04-06 18:00:00', '理发店放快递 费用', '1', '2', '2018-04-06 20:40:27', '2', '2018-04-06 20:40:27', '1');
INSERT INTO `console_consumer_info` VALUES ('158', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '3200', '2', '张辉', '2018-04-06 18:29:00', '凉菜', '1', '2', '2018-04-06 20:42:15', '2', '2018-04-06 20:42:15', '1');
INSERT INTO `console_consumer_info` VALUES ('159', '2', '上海市', '嘉定区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '1980', '2', '张梓瞳', '2018-04-07 15:57:00', '乳酸菌95', '1', '2', '2018-04-07 16:29:56', '2', '2018-04-07 16:29:56', '1');
INSERT INTO `console_consumer_info` VALUES ('160', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '890', '2', '张梓瞳', '2018-04-07 15:57:00', '金锣玉米热狗', '1', '2', '2018-04-07 16:30:39', '2', '2018-04-07 16:30:39', '1');
INSERT INTO `console_consumer_info` VALUES ('161', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1056', '2', '家庭', '2018-04-07 15:57:00', '琵琶腿', '1', '2', '2018-04-07 16:31:46', '2', '2018-04-07 16:31:46', '1');
INSERT INTO `console_consumer_info` VALUES ('162', '2', '上海市', '嘉定区', '0107', '蔬菜', '01', '食品烟酒', '301', '2', '家庭', '2018-04-07 15:57:00', 'MS卷心菜', '1', '2', '2018-04-07 16:33:32', '2', '2018-04-07 16:33:32', '1');
INSERT INTO `console_consumer_info` VALUES ('163', '2', '上海市', '嘉定区', '0405', '个人', '04', '生活及服务', '100', '2', '张纪堂', '2018-04-07 15:57:00', '塑料盒', '1', '2', '2018-04-07 16:34:10', '2', '2018-04-07 16:34:10', '1');
INSERT INTO `console_consumer_info` VALUES ('164', '2', '上海市', '嘉定区', '0402', '家用器具', '04', '生活用品及服务', '139900', '2', '家庭', '2018-04-07 15:57:00', '购买热水器，交房租时扣掉', '1', '2', '2018-04-07 16:41:16', '2', '2018-04-07 16:41:16', '1');
INSERT INTO `console_consumer_info` VALUES ('165', '2', '上海市', '嘉定区', '0405', '个人', '04', '生活及服务', '100', '2', '李玉纳', '2018-04-07 17:00:00', '快递放理发店费用', '1', '2', '2018-04-07 17:07:34', '2', '2018-04-07 17:07:34', '1');
INSERT INTO `console_consumer_info` VALUES ('166', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '946', '2', '张辉', '2018-04-08 11:44:00', '午餐（面条）', '1', '2', '2018-04-08 21:18:16', '2', '2018-04-08 21:18:16', '1');
INSERT INTO `console_consumer_info` VALUES ('167', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1146', '2', '张辉', '2018-04-09 11:18:00', '午餐（面条）', '1', '2', '2018-04-09 21:57:17', '2', '2018-04-09 21:57:17', '1');
INSERT INTO `console_consumer_info` VALUES ('168', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '5000', '2', '张辉', '2018-04-09 19:57:00', '地铁卡充值', '1', '2', '2018-04-09 21:57:57', '2', '2018-04-09 21:57:57', '1');
INSERT INTO `console_consumer_info` VALUES ('169', '2', '上海市', '普陀区', '0805', '退款', '08', '收入', '24450', '1', '张纪堂', '2018-04-09 08:13:00', '火车票退款', '1', '2', '2018-04-09 21:59:18', '2', '2018-04-09 21:59:18', '1');
INSERT INTO `console_consumer_info` VALUES ('170', '2', '上海市', '普陀区', '0805', '退款', '08', '收入', '26150', '1', '张银荣', '2018-04-09 08:12:00', '火车票退款', '1', '2', '2018-04-09 22:00:02', '2', '2018-04-09 22:00:02', '1');
INSERT INTO `console_consumer_info` VALUES ('171', '2', '上海市', '普陀区', '0302', '住房保养、维修及管理', '03', '居住', '30000', '2', '家庭', '2018-04-09 11:54:00', '燃气管费用', '1', '2', '2018-04-09 22:02:12', '2', '2018-04-09 22:02:12', '1');
INSERT INTO `console_consumer_info` VALUES ('172', '2', '上海市', '嘉定区', '0805', '退款', '08', '收入', '12850', '1', '张辉', '2018-04-10 09:32:00', '火车票退款', '1', '2', '2018-04-11 08:05:23', '2', '2018-04-11 08:05:23', '1');
INSERT INTO `console_consumer_info` VALUES ('173', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '22250', '2', '张辉', '2018-04-10 09:32:00', '上海到鹤壁，硬卧，k164', '1', '2', '2018-04-11 08:06:13', '2', '2018-04-11 08:06:13', '1');
INSERT INTO `console_consumer_info` VALUES ('174', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-10 00:11:00', '午餐', '1', '2', '2018-04-11 08:06:57', '2', '2018-04-11 08:06:57', '1');
INSERT INTO `console_consumer_info` VALUES ('175', '2', '上海市', '嘉定区', '0103', '烟酒', '01', '食品烟酒', '900', '2', '张辉', '2018-04-10 00:25:00', '日用', '1', '2', '2018-04-11 08:08:48', '2', '2018-04-11 08:08:48', '1');
INSERT INTO `console_consumer_info` VALUES ('176', '2', '上海市', '普陀区', '0301', '租赁房房租', '03', '居住', '973500', '2', '家庭', '2018-04-10 09:00:00', '2018年4月13至2018年7月12房租', '1', '2', '2018-04-11 08:10:49', '2', '2018-04-11 08:10:49', '1');
INSERT INTO `console_consumer_info` VALUES ('177', '2', '上海市', '普陀区', '0805', '退款', '08', '收入', '22250', '1', '张辉', '2018-04-12 22:29:00', '火车票退款', '1', '2', '2018-04-13 08:22:57', '2', '2018-04-13 08:22:57', '1');
INSERT INTO `console_consumer_info` VALUES ('178', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '22250', '2', '李玉纳', '2018-04-13 15:16:00', '郑州到上海火车票 硬卧', '1', '2', '2018-04-14 14:51:13', '2', '2018-04-14 14:51:13', '1');
INSERT INTO `console_consumer_info` VALUES ('179', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-13 00:04:00', '午餐（面条）', '1', '2', '2018-04-14 14:51:55', '2', '2018-04-14 14:51:55', '1');
INSERT INTO `console_consumer_info` VALUES ('180', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '4380', '2', '家庭', '2018-04-14 16:45:00', '玉米肠、火腿肠、金针菇、豆腐', '1', '2', '2018-04-15 20:18:31', '2', '2018-04-15 20:18:31', '1');
INSERT INTO `console_consumer_info` VALUES ('181', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '6800', '2', '家庭', '2018-04-14 18:54:00', '千叶豆腐', '1', '2', '2018-04-15 20:21:42', '2', '2018-04-15 20:21:42', '1');
INSERT INTO `console_consumer_info` VALUES ('182', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '4180', '2', '家庭', '2018-04-14 18:54:00', '仿蟹排', '1', '2', '2018-04-15 20:22:35', '2', '2018-04-15 20:22:35', '1');
INSERT INTO `console_consumer_info` VALUES ('183', '2', '上海市', '嘉定区', '0601', '教育', '06', '教育、文化和娱乐', '1980', '2', '张梓瞳', '2018-04-14 21:17:00', '看图识字儿童学习卡', '1', '2', '2018-04-15 20:23:46', '2', '2018-04-15 20:23:46', '1');
INSERT INTO `console_consumer_info` VALUES ('184', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1450', '2', '家庭', '2018-04-14 21:40:00', '老干妈、十三香', '1', '2', '2018-04-15 20:24:26', '2', '2018-04-15 20:24:26', '1');
INSERT INTO `console_consumer_info` VALUES ('185', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '3800', '2', '张银荣', '2018-04-14 15:13:00', '红米note2 电池', '1', '2', '2018-04-15 20:26:03', '2', '2018-04-15 20:26:03', '1');
INSERT INTO `console_consumer_info` VALUES ('186', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '6619', '2', '家庭', '2018-04-15 16:52:00', '纯牛奶、饼干、面包', '1', '2', '2018-04-15 20:27:10', '2', '2018-04-15 20:27:10', '1');
INSERT INTO `console_consumer_info` VALUES ('187', '2', '上海市', '静安区', '0805', '退款', '08', '收入', '1200', '1', '退款', '2018-04-16 21:37:00', '火车票退款', '1', '2', '2018-04-20 08:43:37', '2', '2018-04-20 08:43:37', '1');
INSERT INTO `console_consumer_info` VALUES ('188', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '24450', '2', '张纪堂', '2018-04-16 09:17:00', '上海到郑州火车票', '1', '2', '2018-04-20 08:48:46', '2', '2018-04-20 08:48:46', '1');
INSERT INTO `console_consumer_info` VALUES ('189', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '24450', '2', '张银荣', '2018-04-16 09:17:00', '上海到郑州火车票', '1', '2', '2018-04-20 08:49:31', '2', '2018-04-20 08:49:31', '1');
INSERT INTO `console_consumer_info` VALUES ('190', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-16 00:14:00', '午餐（面条）', '1', '2', '2018-04-20 08:50:19', '2', '2018-04-20 08:50:19', '1');
INSERT INTO `console_consumer_info` VALUES ('191', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-17 00:16:00', '午餐（面条）', '1', '2', '2018-04-20 08:51:38', '2', '2018-04-20 08:51:38', '1');
INSERT INTO `console_consumer_info` VALUES ('192', '2', '上海市', '普陀区', '0404', '家庭日用杂品', '04', '生活用品及服务', '2660', '2', '家庭', '2018-04-17 22:56:00', '厕纸', '1', '2', '2018-04-20 08:54:17', '2', '2018-04-20 08:54:17', '1');
INSERT INTO `console_consumer_info` VALUES ('193', '2', '上海市', '普陀区', '0404', '家庭日用杂品', '04', '生活用品及服务', '2999', '2', '家庭', '2018-04-17 23:26:00', '家庭日用抽纸', '1', '2', '2018-04-20 08:55:34', '2', '2018-04-20 08:55:34', '1');
INSERT INTO `console_consumer_info` VALUES ('194', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-18 00:10:00', '午餐（面条）', '1', '2', '2018-04-20 08:56:42', '2', '2018-04-20 08:56:42', '1');
INSERT INTO `console_consumer_info` VALUES ('195', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-19 00:25:00', '午餐（面条）', '1', '2', '2018-04-20 08:57:43', '2', '2018-04-20 08:57:43', '1');
INSERT INTO `console_consumer_info` VALUES ('196', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '550', '2', '张纪堂', '2018-04-20 06:31:00', '杂粮煎饼，早餐', '1', '2', '2018-04-20 08:58:49', '2', '2018-04-20 08:58:49', '1');
INSERT INTO `console_consumer_info` VALUES ('197', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '550', '2', '张银荣', '2018-04-20 06:31:00', '杂粮煎饼，早餐', '1', '2', '2018-04-20 08:59:22', '2', '2018-04-20 08:59:22', '1');
INSERT INTO `console_consumer_info` VALUES ('198', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '600', '2', '张辉', '2018-04-20 08:19:00', '早餐-鸡蛋饼', '1', '2', '2018-04-20 09:00:09', '2', '2018-04-20 09:00:09', '1');
INSERT INTO `console_consumer_info` VALUES ('199', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '1580', '2', '张辉', '2018-04-16 23:24:00', '干凉皮', '1', '2', '2018-04-20 09:05:32', '2', '2018-04-20 09:05:32', '1');
INSERT INTO `console_consumer_info` VALUES ('200', '2', '上海市', '嘉定区', '0408', '红包', '04', '生活用品及服务', '10000', '2', '李玉纳', '2018-04-17 16:06:00', '微信红包', '1', '2', '2018-04-20 09:06:38', '2', '2018-04-20 09:06:38', '1');
INSERT INTO `console_consumer_info` VALUES ('201', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '2350', '2', '张辉', '2018-04-20 09:21:00', '郑州到鹤壁火车票', '1', '2', '2018-04-23 19:46:46', '2', '2018-04-23 19:46:46', '1');
INSERT INTO `console_consumer_info` VALUES ('202', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '2350', '2', '李玉纳', '2018-04-20 11:21:00', '郑州到鹤壁火车票', '1', '2', '2018-04-23 19:54:11', '2', '2018-04-23 19:54:11', '1');
INSERT INTO `console_consumer_info` VALUES ('203', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '44700', '2', '张辉', '2018-04-20 09:25:00', '上海到郑州火车票', '1', '2', '2018-04-23 19:59:12', '2', '2018-04-23 19:59:12', '1');
INSERT INTO `console_consumer_info` VALUES ('204', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '44700', '2', '李玉纳', '2018-04-20 09:25:00', '上海到郑州火车票', '1', '2', '2018-04-23 19:59:48', '2', '2018-04-23 19:59:48', '1');
INSERT INTO `console_consumer_info` VALUES ('205', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1300', '2', '张辉', '2018-04-20 00:07:00', '午餐（面条）', '1', '2', '2018-04-23 20:14:39', '2', '2018-04-23 20:14:39', '1');
INSERT INTO `console_consumer_info` VALUES ('206', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '1998', '2', '张辉', '2018-04-20 20:18:00', '打车（金沙江西路到上海虹桥站）', '1', '2', '2018-04-23 20:16:03', '2', '2018-04-23 20:16:03', '1');
INSERT INTO `console_consumer_info` VALUES ('207', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '4200', '2', '张辉', '2018-04-20 21:45:00', '打车（上海虹桥站到真光新村第八小区）', '1', '2', '2018-04-23 20:18:28', '2', '2018-04-23 20:18:28', '1');
INSERT INTO `console_consumer_info` VALUES ('208', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '2350', '2', '张纪堂', '2018-04-21 08:29:00', '郑州到鹤壁火车票', '1', '2', '2018-04-23 20:20:06', '2', '2018-04-23 20:20:06', '1');
INSERT INTO `console_consumer_info` VALUES ('209', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '2350', '2', '张银荣', '2018-04-21 08:29:00', '郑州到鹤壁火车票', '1', '2', '2018-04-23 20:21:13', '2', '2018-04-23 20:21:13', '1');
INSERT INTO `console_consumer_info` VALUES ('210', '2', '上海市', '长宁区', '0101', '食品', '01', '食品烟酒', '1200', '2', '张辉', '2018-04-21 13:35:00', '玉米，一个6元', '1', '2', '2018-04-23 20:24:01', '2', '2018-04-23 20:24:01', '1');
INSERT INTO `console_consumer_info` VALUES ('211', '2', '上海市', '普陀区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '2120', '2', '张辉', '2018-04-22 13:08:00', '橙汁 雪碧', '1', '2', '2018-04-23 20:25:35', '2', '2018-04-23 20:25:35', '1');
INSERT INTO `console_consumer_info` VALUES ('212', '2', '上海市', '嘉定区', '0805', '退款', '08', '收入', '500', '1', '退款', '2018-04-23 11:21:00', '火车票退款', '1', '2', '2018-04-23 20:26:33', '2', '2018-04-23 20:26:33', '1');
INSERT INTO `console_consumer_info` VALUES ('213', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1300', '2', '张辉', '2018-04-23 00:14:00', '午餐（面条）', '1', '2', '2018-04-23 20:28:47', '2', '2018-04-23 20:28:47', '1');
INSERT INTO `console_consumer_info` VALUES ('214', '2', '上海市', '嘉定区', '0801', '工资', '08', '收入', '1590650', '1', '工资', '2018-04-20 17:00:00', '2018年3月份工资', '2', '2', '2018-04-23 20:30:04', '2', '2018-04-23 20:30:04', '1');
INSERT INTO `console_consumer_info` VALUES ('215', '2', '上海市', '普陀区', '0406', '家庭服务', '04', '生活用品及服务', '400000', '2', '张纪堂', '2018-04-22 09:00:00', '奶奶三年上礼费用以及爸妈回家生活费', '1', '2', '2018-04-24 09:03:12', '2', '2018-04-24 09:03:12', '1');
INSERT INTO `console_consumer_info` VALUES ('216', '2', '上海市', '普陀区', '0106', '水果', '01', '食品烟酒', '1500', '2', '张辉', '2018-04-24 20:51:00', '菠萝', '1', '2', '2018-04-25 19:42:13', '2', '2018-04-25 19:42:13', '1');
INSERT INTO `console_consumer_info` VALUES ('217', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '2350', '2', '李玉纳', '2018-04-26 00:16:00', '鹤壁到郑州火车票', '1', '2', '2018-04-28 19:19:11', '2', '2018-04-28 19:19:11', '1');
INSERT INTO `console_consumer_info` VALUES ('218', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1287', '2', '张辉', '2018-04-28 00:06:00', '午餐（面条）', '1', '2', '2018-04-28 19:19:49', '2', '2018-04-28 19:19:49', '1');
INSERT INTO `console_consumer_info` VALUES ('219', '0', '上海市', '闵行区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '300', '2', '张辉', '2018-04-29 15:16:00', '矿泉水', '1', '0', '2018-05-03 10:28:33', '0', '2018-05-03 10:28:33', '1');
INSERT INTO `console_consumer_info` VALUES ('220', '2', '上海市', '闵行区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '300', '2', '张辉', '2018-04-29 15:16:00', '矿泉水', '1', '2', '2018-05-03 10:29:21', '2', '2018-05-03 10:29:21', '1');
INSERT INTO `console_consumer_info` VALUES ('221', '2', '上海市', '闵行区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '300', '2', '李玉纳', '2018-04-29 15:17:00', '矿泉水', '1', '2', '2018-05-03 10:29:53', '2', '2018-05-03 10:29:53', '1');
INSERT INTO `console_consumer_info` VALUES ('222', '2', '上海市', '闵行区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '300', '2', '李凤学', '2018-04-29 15:23:00', '矿泉水', '1', '2', '2018-05-03 10:30:31', '2', '2018-05-03 10:30:31', '1');
INSERT INTO `console_consumer_info` VALUES ('223', '2', '上海市', '闵行区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '300', '2', '谢连英', '2018-04-29 15:24:00', '矿泉水', '1', '2', '2018-05-03 10:31:01', '2', '2018-05-03 10:31:01', '1');
INSERT INTO `console_consumer_info` VALUES ('224', '2', '河南省', '郑州市', '0501', '交通', '05', '交通和通信', '300', '2', '张辉', '2018-04-29 21:38:00', '郑州东站到郑州火车站地铁票', '1', '2', '2018-05-03 10:32:17', '2', '2018-05-03 10:32:17', '1');
INSERT INTO `console_consumer_info` VALUES ('225', '2', '河南省', '郑州市', '0501', '交通', '05', '交通和通信', '300', '2', '李玉纳', '2018-04-29 21:38:00', '郑州东站到郑州火车站地铁票', '1', '2', '2018-05-03 10:32:51', '2', '2018-05-03 10:32:51', '1');
INSERT INTO `console_consumer_info` VALUES ('226', '2', '河南省', '鹤壁市', '0101', '食品', '01', '食品烟酒', '598', '2', '李玉纳', '2018-04-30 01:00:00', '米线', '1', '2', '2018-05-03 10:34:55', '2', '2018-05-03 10:34:55', '1');
INSERT INTO `console_consumer_info` VALUES ('227', '2', '河南省', '鹤壁市', '0102', '饮料（不含酒精）', '01', '食品烟酒', '1400', '2', '张梓瞳', '2018-04-30 10:07:00', '8瓶娃哈哈', '1', '2', '2018-05-03 10:37:40', '2', '2018-05-03 10:37:40', '1');
INSERT INTO `console_consumer_info` VALUES ('228', '2', '河南省', '鹤壁市', '0101', '食品', '01', '食品烟酒', '2330', '2', '张辉', '2018-04-30 13:43:00', '干吃面，火腿肠等', '1', '2', '2018-05-03 10:39:38', '2', '2018-05-03 10:39:38', '1');
INSERT INTO `console_consumer_info` VALUES ('229', '2', '河南省', '鹤壁市', '0104', '饮食', '01', '食品烟酒', '200', '2', '李玉纳', '2018-04-30 13:46:00', '冰淇淋', '1', '2', '2018-05-03 10:46:38', '2', '2018-05-03 10:46:38', '1');
INSERT INTO `console_consumer_info` VALUES ('230', '2', '河南省', '鹤壁市', '0201', '衣类', '02', '衣着', '5000', '2', '李玉纳', '2018-04-30 14:00:00', '购买短袖两件', '1', '2', '2018-05-03 10:49:34', '2', '2018-05-03 10:49:34', '1');
INSERT INTO `console_consumer_info` VALUES ('231', '2', '河南省', '鹤壁市', '0405', '个人', '04', '生活及服务', '200', '2', '张梓瞳', '2018-04-30 14:08:00', '吃饭勺子', '1', '2', '2018-05-03 10:50:23', '2', '2018-05-03 10:50:23', '1');
INSERT INTO `console_consumer_info` VALUES ('232', '2', '河南省', '鹤壁市', '0101', '食品', '01', '食品烟酒', '1000', '2', '张辉', '2018-04-30 17:26:00', '烧饼', '1', '2', '2018-05-03 10:51:25', '2', '2018-05-03 10:51:25', '1');
INSERT INTO `console_consumer_info` VALUES ('233', '2', '河南省', '鹤壁市', '0805', '退款', '08', '收入', '1900', '1', '退款', '2018-04-30 18:21:00', '鹤壁到郑州  火车票退款', '2', '2', '2018-05-03 10:52:53', '2', '2018-05-03 10:52:53', '1');
INSERT INTO `console_consumer_info` VALUES ('234', '2', '河南省', '鹤壁市', '0805', '退款', '08', '收入', '1900', '1', '退款', '2018-04-30 18:22:00', '鹤壁到郑州  火车票退款', '2', '2', '2018-05-03 10:53:23', '2', '2018-05-03 10:53:23', '1');
INSERT INTO `console_consumer_info` VALUES ('235', '2', '河南省', '鹤壁市', '0405', '个人', '04', '生活及服务', '700', '2', '张辉', '2018-04-30 18:12:00', '理发', '1', '2', '2018-05-03 11:18:56', '2', '2018-05-03 11:18:56', '1');
INSERT INTO `console_consumer_info` VALUES ('236', '2', '河南省', '鹤壁市', '0405', '个人', '04', '生活及服务', '400', '2', '张梓瞳', '2018-04-30 18:12:00', '理发', '1', '2', '2018-05-03 11:19:33', '2', '2018-05-03 11:19:33', '1');
INSERT INTO `console_consumer_info` VALUES ('237', '2', '河南省', '郑州市', '0101', '食品', '01', '食品烟酒', '1100', '2', '张辉', '2018-04-30 19:18:00', '泡面、辣条', '1', '2', '2018-05-03 11:42:31', '2', '2018-05-03 11:42:31', '1');
INSERT INTO `console_consumer_info` VALUES ('238', '2', '河南省', '郑州市', '0101', '食品', '01', '食品烟酒', '600', '2', '张辉', '2018-05-01 20:09:00', '泡面', '1', '2', '2018-05-03 11:43:01', '2', '2018-05-03 11:43:01', '1');
INSERT INTO `console_consumer_info` VALUES ('239', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '10000', '2', '张辉', '2018-05-02 07:28:00', '地铁卡充值', '1', '2', '2018-05-03 11:44:01', '2', '2018-05-03 11:44:01', '1');
INSERT INTO `console_consumer_info` VALUES ('240', '2', '上海市', '嘉定区', '0104', '饮食', '01', '食品烟酒', '448', '2', '张辉', '2018-05-02 07:32:00', '早餐', '1', '2', '2018-05-03 11:45:45', '2', '2018-05-03 11:45:45', '1');
INSERT INTO `console_consumer_info` VALUES ('241', '2', '上海市', '嘉定区', '0104', '饮食', '01', '食品烟酒', '1300', '2', '张辉', '2018-05-02 00:16:00', '午餐（面条）', '1', '2', '2018-05-03 11:46:40', '2', '2018-05-03 11:46:40', '1');
INSERT INTO `console_consumer_info` VALUES ('242', '2', '上海市', '嘉定区', '0408', '红包', '04', '生活及服务', '60000', '2', '张辉', '2018-05-02 08:51:00', '刘岩结婚礼钱', '1', '2', '2018-05-03 11:48:12', '2', '2018-05-03 11:48:12', '1');
INSERT INTO `console_consumer_info` VALUES ('243', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '69826', '2', '张梓瞳', '2018-05-02 21:12:00', '购买奶粉4罐', '1', '2', '2018-05-03 11:50:29', '2', '2018-05-03 11:50:29', '1');
INSERT INTO `console_consumer_info` VALUES ('244', '2', '上海市', '普陀区', '0502', '通信', '05', '交通和通信', '4998', '2', '张辉', '2018-05-03 08:17:00', '话费充值', '1', '2', '2018-05-03 11:51:11', '2', '2018-05-03 11:51:11', '1');
INSERT INTO `console_consumer_info` VALUES ('245', '2', '上海市', '普陀区', '0106', '水果', '01', '食品烟酒', '2500', '2', '张辉', '2018-05-03 20:59:00', '菠萝、草莓', '1', '2', '2018-05-04 16:36:50', '2', '2018-05-04 16:36:50', '1');
INSERT INTO `console_consumer_info` VALUES ('246', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '22250', '2', '张辉', '2018-05-03 22:23:00', '上海到郑州，硬卧', '1', '2', '2018-05-04 16:37:41', '2', '2018-05-04 16:37:41', '1');
INSERT INTO `console_consumer_info` VALUES ('247', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '2350', '2', '张辉', '2018-05-03 22:32:00', '郑州到鹤壁，硬座', '1', '2', '2018-05-04 16:38:25', '2', '2018-05-04 16:38:25', '1');
INSERT INTO `console_consumer_info` VALUES ('248', '2', '上海市', '嘉定区', '0501', '交通', '05', '交通和通信', '1155', '2', '张辉', '2018-05-04 08:58:00', '早上上班打车', '1', '2', '2018-05-04 16:39:18', '2', '2018-05-04 16:39:18', '1');
INSERT INTO `console_consumer_info` VALUES ('249', '0', '河南省', '安阳市', '0101', '食品', '01', '食品烟酒', '700', '2', '张辉', '2018-05-05 11:50:00', '蛋黄派、面包', '1', '0', '2018-05-08 16:53:47', '0', '2018-05-08 16:53:47', '1');
INSERT INTO `console_consumer_info` VALUES ('250', '2', '河南省', '安阳市', '0101', '食品', '01', '食品烟酒', '700', '2', '张辉', '2018-05-05 11:50:00', '蛋黄派、面包', '1', '2', '2018-05-08 16:54:29', '2', '2018-05-08 16:54:29', '1');
INSERT INTO `console_consumer_info` VALUES ('251', '2', '河南省', '安阳市', '0102', '饮料（不含酒精）', '01', '食品烟酒', '800', '2', '张辉', '2018-05-05 11:52:00', '脉动两瓶', '1', '2', '2018-05-08 16:55:11', '2', '2018-05-08 16:55:11', '1');
INSERT INTO `console_consumer_info` VALUES ('252', '2', '河南省', '鹤壁市', '0501', '交通', '05', '交通和通信', '50700', '2', '张辉', '2018-05-06 08:31:00', '鹤壁到郑州，高铁', '1', '2', '2018-05-08 16:56:00', '2', '2018-05-08 16:56:00', '1');
INSERT INTO `console_consumer_info` VALUES ('253', '2', '河南省', '鹤壁市', '0303', '水、电、燃料', '03', '居住', '8970', '2', '家庭', '2018-05-06 09:11:00', '2018年4月水费', '1', '2', '2018-05-08 16:57:01', '2', '2018-05-08 16:57:01', '1');
INSERT INTO `console_consumer_info` VALUES ('254', '2', '河南省', '鹤壁市', '0303', '水、电、燃料', '03', '居住', '8910', '2', '家庭', '2018-05-06 09:11:00', '2018年4月电费', '1', '2', '2018-05-08 16:57:52', '2', '2018-05-08 16:57:52', '1');
INSERT INTO `console_consumer_info` VALUES ('255', '2', '河南省', '鹤壁市', '0303', '水、电、燃料', '03', '居住', '7030', '2', '家庭', '2018-05-06 09:11:00', '2018年5月电费', '1', '2', '2018-05-08 16:58:31', '2', '2018-05-08 16:58:31', '1');
INSERT INTO `console_consumer_info` VALUES ('256', '2', '上海市', '长宁区', '0501', '交通', '05', '交通和通信', '1284', '2', '张辉', '2018-05-07 16:25:00', '滴滴打车，淞虹路-金汤路', '1', '2', '2018-05-08 17:00:37', '2', '2018-05-08 17:00:37', '1');
INSERT INTO `console_consumer_info` VALUES ('257', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '200', '2', '张辉', '2018-05-07 17:29:00', '牛奶放理发店费用', '1', '2', '2018-05-08 17:03:10', '2', '2018-05-08 17:03:10', '1');
INSERT INTO `console_consumer_info` VALUES ('258', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '450', '2', '张辉', '2018-05-07 17:29:00', '面条', '1', '2', '2018-05-08 17:04:09', '2', '2018-05-08 17:04:09', '1');
INSERT INTO `console_consumer_info` VALUES ('259', '2', '上海市', '普陀区', '0101', '食品', '01', '食品烟酒', '600', '2', '张辉', '2018-05-07 17:37:00', '购买油条', '1', '2', '2018-05-08 17:04:57', '2', '2018-05-08 17:04:57', '1');
INSERT INTO `console_consumer_info` VALUES ('260', '2', '上海市', '普陀区', '0107', '蔬菜', '01', '食品烟酒', '500', '2', '家庭', '2018-05-07 17:40:00', '圣女果，香菜', '1', '2', '2018-05-08 17:06:04', '2', '2018-05-08 17:06:04', '1');
INSERT INTO `console_consumer_info` VALUES ('261', '2', '上海市', '普陀区', '0107', '蔬菜', '01', '食品烟酒', '6492', '2', '家庭', '2018-05-07 21:12:00', '挂面，白菜，火腿肠，南瓜，洋葱，饺子，小笼包', '1', '2', '2018-05-08 17:07:35', '2', '2018-05-08 17:07:35', '1');
INSERT INTO `console_consumer_info` VALUES ('262', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1300', '2', '张辉', '2018-05-08 00:15:00', '午餐（面条）', '1', '2', '2018-05-08 17:08:44', '2', '2018-05-08 17:08:44', '1');
INSERT INTO `console_consumer_info` VALUES ('263', '2', '河南省', '鹤壁市', '0106', '水果', '01', '食品烟酒', '300', '2', '张梓瞳', '2018-05-06 18:36:00', '购买橙子', '1', '2', '2018-05-08 17:10:17', '2', '2018-05-08 17:10:17', '1');
INSERT INTO `console_consumer_info` VALUES ('264', '2', '上海市', '普陀区', '0501', '交通', '05', '交通和通信', '2060', '2', '张辉', '2018-05-08 08:01:00', '购买摩拜单车月卡', '1', '2', '2018-05-08 17:10:55', '2', '2018-05-08 17:10:55', '1');
INSERT INTO `console_consumer_info` VALUES ('265', '2', '上海市', '普陀区', '0406', '家庭服务', '04', '生活及服务', '50000', '2', '谢连英', '2018-05-07 18:00:00', '娜娜妈妈5月生活费', '1', '2', '2018-05-08 17:12:51', '2', '2018-05-08 17:12:51', '1');
INSERT INTO `console_consumer_info` VALUES ('266', '2', '上海市', '普陀区', '0404', '家庭日用杂品', '04', '生活用品及服务', '3190', '2', '家庭', '2018-05-09 07:50:00', '清风卷纸卫生纸', '1', '2', '2018-05-13 23:25:33', '2', '2018-05-13 23:25:33', '1');
INSERT INTO `console_consumer_info` VALUES ('267', '2', '上海市', '嘉定区', '0104', '饮食', '01', '食品烟酒', '900', '2', '张辉', '2018-05-09 11:22:00', '午餐（米饭）', '1', '2', '2018-05-13 23:26:22', '2', '2018-05-13 23:26:22', '1');
INSERT INTO `console_consumer_info` VALUES ('268', '2', '上海市', '嘉定区', '0408', '红包', '04', '生活用品及服务', '50000', '2', '张辉', '2018-05-09 14:22:00', '王党伟结婚礼钱', '1', '2', '2018-05-13 23:27:06', '2', '2018-05-13 23:27:06', '1');
INSERT INTO `console_consumer_info` VALUES ('269', '2', '上海市', '普陀区', '0104', '饮食', '01', '食品烟酒', '1100', '2', '李玉纳', '2018-05-10 19:24:00', '酸辣粉，打包', '1', '2', '2018-05-13 23:28:29', '2', '2018-05-13 23:28:29', '1');
INSERT INTO `console_consumer_info` VALUES ('270', '2', '上海市', '普陀区', '0106', '水果', '01', '食品烟酒', '320', '2', '家庭', '2018-05-10 19:45:00', '橙子', '1', '2', '2018-05-13 23:29:18', '2', '2018-05-13 23:29:18', '1');
INSERT INTO `console_consumer_info` VALUES ('271', '2', '上海市', '嘉定区', '0104', '饮食', '01', '食品烟酒', '1300', '2', '张辉', '2018-05-11 00:15:00', '午餐（面条）', '1', '2', '2018-05-13 23:31:03', '2', '2018-05-13 23:31:03', '1');
INSERT INTO `console_consumer_info` VALUES ('272', '2', '上海市', '普陀区', '0107', '蔬菜', '01', '食品烟酒', '10000', '2', '家庭', '2018-05-12 07:00:00', '西瓜，豆角，西红柿，苹果，猪肉等', '1', '2', '2018-05-13 23:34:20', '2', '2018-05-13 23:34:20', '1');
INSERT INTO `console_consumer_info` VALUES ('273', '2', '上海市', '普陀区', '0502', '通信', '05', '交通和通信', '4986', '2', '张辉', '2018-05-13 19:38:00', '手机话费', '1', '2', '2018-05-13 23:35:25', '2', '2018-05-13 23:35:25', '1');
INSERT INTO `console_consumer_info` VALUES ('274', '2', '上海市', '普陀区', '0404', '家庭日用杂品', '04', '生活用品及服务', '2500', '2', '家庭', '2018-05-13 20:02:00', '客厅节能灯', '1', '2', '2018-05-13 23:36:12', '2', '2018-05-13 23:36:12', '1');
INSERT INTO `console_consumer_info` VALUES ('275', '2', '上海市', '普陀区', '0408', '红包', '04', '生活用品及服务', '5130', '2', '张银荣', '2018-05-13 18:52:00', '母亲节，红包', '1', '2', '2018-05-13 23:37:09', '2', '2018-05-13 23:37:09', '1');
INSERT INTO `console_consumer_info` VALUES ('276', '2', '上海市', '普陀区', '0103', '烟酒', '01', '食品烟酒', '800', '2', '张辉', '2018-05-14 08:25:00', '红双喜', '1', '2', '2018-05-15 14:10:16', '2', '2018-05-15 14:10:16', '1');
INSERT INTO `console_consumer_info` VALUES ('277', '2', '上海市', '嘉定区', '0104', '饮食', '01', '食品烟酒', '1300', '2', '张辉', '2018-05-14 00:12:00', '午餐（面条）', '1', '2', '2018-05-15 14:10:59', '2', '2018-05-15 14:10:59', '1');
INSERT INTO `console_consumer_info` VALUES ('278', '2', '上海市', '嘉定区', '0404', '家庭日用', '04', '生活及服务', '63000', '2', '家庭', '2018-05-14 21:43:00', '购买二手电动车', '1', '2', '2018-05-15 14:13:19', '2', '2018-05-15 14:13:19', '1');
INSERT INTO `console_consumer_info` VALUES ('279', '2', '上海市', '嘉定区', '0404', '家庭日用', '04', '生活及服务', '4500', '2', '家庭', '2018-05-15 08:23:00', '电动车 锁', '1', '2', '2018-05-15 14:14:09', '2', '2018-05-15 14:14:09', '1');
INSERT INTO `console_consumer_info` VALUES ('280', '2', '上海市', '嘉定区', '0404', '家庭日用', '04', '生活及服务', '3200', '2', '家庭', '2018-05-15 08:59:00', '电动车充电线', '1', '2', '2018-05-15 14:14:51', '2', '2018-05-15 14:14:51', '1');
INSERT INTO `console_consumer_info` VALUES ('281', '2', '上海市', '嘉定区', '0101', '食品', '01', '食品烟酒', '1300', '2', '张辉', '2018-05-15 00:10:00', '午餐（面条）', '1', '2', '2018-05-15 14:15:19', '2', '2018-05-15 14:15:19', '1');
INSERT INTO `console_consumer_info` VALUES ('282', '2', '上海市', '嘉定区', '0104', '饮食', '01', '食品烟酒', '19900', '2', '张辉', '2018-05-15 13:20:00', '请振凯吃饭-上海小龙虾', '1', '2', '2018-05-15 14:16:09', '2', '2018-05-15 14:16:09', '1');
INSERT INTO `console_consumer_info` VALUES ('283', '2', '上海市', '浦东新区', '0104', '饮食', '01', '食品烟酒', '2000', '2', '张辉', '2018-05-15 18:41:00', '馄饨、水煎包', '1', '2', '2018-05-19 13:53:49', '2', '2018-05-19 13:53:49', '1');
INSERT INTO `console_consumer_info` VALUES ('284', '2', '上海市', '浦东新区', '0102', '饮料（不含酒精）', '01', '食品烟酒', '1600', '2', '张辉', '2018-05-15 21:14:00', '雪碧、美连达', '1', '2', '2018-05-19 13:54:52', '2', '2018-05-19 13:54:52', '1');
INSERT INTO `console_consumer_info` VALUES ('285', '2', '上海市', '嘉定区', '0104', '饮食', '01', '食品烟酒', '1400', '2', '张辉', '2018-05-16 00:19:00', '午餐（面条）', '1', '2', '2018-05-19 13:55:51', '2', '2018-05-19 13:55:51', '1');
INSERT INTO `console_consumer_info` VALUES ('286', '2', '上海市', '嘉定区', '0104', '饮食', '01', '食品烟酒', '1046', '2', '张辉', '2018-05-17 11:34:00', '午餐、外卖（面条）', '1', '2', '2018-05-19 13:57:01', '2', '2018-05-19 13:57:01', '1');
INSERT INTO `console_consumer_info` VALUES ('287', '2', '上海市', '嘉定区', '0104', '饮食', '01', '食品烟酒', '1300', '2', '张辉', '2018-05-18 00:07:00', '午餐（面条）', '1', '2', '2018-05-19 13:58:53', '2', '2018-05-19 13:58:53', '1');
INSERT INTO `console_consumer_info` VALUES ('288', '2', '上海市', '普陀区', '0405', '个人', '04', '生活及服务', '1000', '2', '张辉', '2018-05-19 09:29:00', '电动车车罩', '1', '2', '2018-05-19 14:02:03', '2', '2018-05-19 14:02:03', '1');
INSERT INTO `console_consumer_info` VALUES ('289', '2', '上海市', '嘉定区', '0405', '个人', '04', '生活及服务', '6897', '2', '张辉', '2018-05-16 13:55:00', 'iphone6 电池', '1', '2', '2018-05-19 14:04:27', '2', '2018-05-19 14:04:27', '1');
INSERT INTO `console_consumer_info` VALUES ('290', '2', '上海市', '普陀区', '0408', '红包', '04', '生活及服务', '800000', '2', '李玉瑞', '2018-05-17 21:00:00', '小瑞买房 12000+8000', '1', '2', '2018-05-19 14:06:12', '2', '2018-05-19 14:06:12', '1');
INSERT INTO `console_consumer_info` VALUES ('291', '2', '上海市', '普陀区', '0107', '蔬菜', '01', '食品烟酒', '10000', '2', '家庭', '2018-05-19 07:00:00', '豆角、西瓜、香蕉、西红柿、白菜等', '1', '2', '2018-05-19 14:10:22', '2', '2018-05-19 14:10:22', '1');
